<?xml version="1.0" encoding="utf-8"?>
<feed xmlns="http://www.w3.org/2005/Atom">
  <title><![CDATA[Dawei Ma's Notes]]></title>
  
  <link href="/atom.xml" rel="self"/>
  <link href="http://madawei.net/"/>
  <updated>2016-02-01T09:21:11.000Z</updated>
  <id>http://madawei.net/</id>
  
  <author>
    <name><![CDATA[Dawei Ma]]></name>
    
  </author>
  
  <generator uri="http://hexo.io/">Hexo</generator>
  
  <entry>
    <title><![CDATA[打造优雅高效的写作环境]]></title>
    <link href="http://madawei.net/2016/02/01/20160201/"/>
    <id>http://madawei.net/2016/02/01/20160201/</id>
    <published>2016-02-01T04:22:16.000Z</published>
    <updated>2016-02-01T09:21:11.000Z</updated>
    <content type="html"><![CDATA[<h3 id="u524D_u8A00"><a href="#u524D_u8A00" class="headerlink" title="&#x524D;&#x8A00;"></a>&#x524D;&#x8A00;</h3><p>&#x5199;&#x4F5C;&#x662F;&#x4E00;&#x4EF6;&#x5F88;&#x6709;&#x8DA3;&#x7684;&#x4E8B;&#x60C5;&#xFF0C;&#x957F;&#x671F;&#x5F62;&#x6210;&#x826F;&#x597D;&#x7684;&#x5199;&#x4F5C;&#x4E60;&#x60EF;&#x53EF;&#x4EE5;&#x5E2E;&#x52A9;&#x6211;&#x4EEC;&#x6709;&#x6761;&#x7406;&#x7684;&#x5904;&#x7406;&#x89E3;&#x51B3;&#x95EE;&#x9898;&#xFF0C;&#x540C;&#x65F6;&#x7ED9;&#x4EBA;&#x751F;&#x7559;&#x4E0B;&#x70B9;&#x56DE;&#x5FC6;&#x4E5F;&#x4E0D;&#x9519;&#x3002;&#x5728;&#x6211;&#x4EEC;&#x5F88;&#x5C0F;&#x7684;&#x65F6;&#x5019;&#x4E5F;&#x8BB8;&#x5C31;&#x6709;&#x8BB0;&#x65E5;&#x8BB0;&#x7684;&#x4E60;&#x60EF;&#xFF0C;&#x5927;&#x8111;&#x7684;&#x8BB0;&#x5FC6;&#x91CF;&#x6BD5;&#x7ADF;&#x5F88;&#x6709;&#x9650;&#xFF0C;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x7528;&#x7EB8;&#x548C;&#x7B14;&#x6765;&#x8BB0;&#x4E1C;&#x897F;&#xFF0C;&#x4F46;&#x662F;&#x4F20;&#x7EDF;&#x7684;&#x7EB8;&#x548C;&#x7B14;&#x5B58;&#x5728;&#x5F88;&#x5927;&#x7684;&#x95EE;&#x9898;&#xFF0C;&#x65E0;&#x6CD5;&#x957F;&#x4E45;&#x7684;&#x4FDD;&#x5B58;&#x4E1C;&#x897F;&#x3002;&#x8FDB;&#x5165;&#x4E92;&#x8054;&#x7F51;&#x65F6;&#x4EE3;&#x540E;&#x6211;&#x4EEC;&#x6709;&#x4E86;&#x5F88;&#x591A;&#x9009;&#x62E9;&#xFF0C;&#x5404;&#x7C7B;&#x7F51;&#x7AD9;&#x535A;&#x5BA2;&#x3001;&#x4E13;&#x680F;&#x3001;&#x5FAE;&#x535A;&#x3001;&#x516C;&#x4F17;&#x53F7;&#x7B49;&#x53EF;&#x4EE5;&#x8BA9;&#x6211;&#x4EEC;&#x5199;&#x4F5C;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x90FD;&#x65E0;&#x6CD5;&#x89E3;&#x51B3;&#x4EE5;&#x4E0B;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#x3002;</p>
<ol>
<li>&#x6392;&#x7248;&#x3002;&#x7F16;&#x8F91;&#x5668;&#x4E0D;&#x652F;&#x6301;Markdown&#x8BED;&#x6CD5;&#x3002;&#x6BCF;&#x6B21;&#x770B;&#x5230;&#x90A3;&#x79CD;&#x7CDF;&#x7CD5;&#x7684;&#x6392;&#x7248;&#x90FD;&#x8BA9;&#x4EBA;&#x6CA1;&#x6709;&#x770B;&#x7684;&#x6B32;&#x671B;&#x4E86;&#x3002;&#x5F88;&#x591A;&#x5B9D;&#x8D35;&#x7684;&#x65F6;&#x95F4;&#x90FD;&#x6D6A;&#x8D39;&#x5230;&#x6392;&#x7248;&#x4E0A;&#x4E86;&#x3002;</li>
<li>&#x7248;&#x672C;&#x7BA1;&#x7406;&#x3002;&#x5982;&#x679C;&#x6709;&#x591A;&#x4E2A;&#x7248;&#x672C;&#x5E38;&#x89C4;&#x7684;&#x535A;&#x5BA2;&#x53EA;&#x80FD;&#x4F60;&#x81EA;&#x5DF1;&#x6765;&#x4FDD;&#x5B58;&#x4E86;&#xFF0C;&#x4E00;&#x65E6;&#x51FA;&#x9519;&#x5C31;&#x5F88;&#x96BE;&#x56DE;&#x5230;&#x4E4B;&#x524D;&#x7684;&#x7248;&#x672C;&#x4E86;&#x3002;</li>
<li>&#x96BE;&#x4EE5;&#x957F;&#x671F;&#x4FDD;&#x5B58;&#x3002;&#x8BF8;&#x5982;&#x7F51;&#x7AD9;&#x5173;&#x95ED;&#x6216;&#x8005;&#x7535;&#x8111;&#x635F;&#x574F;&#x4E22;&#x5931;&#x90FD;&#x4F1A;&#x5BFC;&#x81F4;&#x4E4B;&#x524D;&#x7684;&#x8D44;&#x6599;&#x4E22;&#x5931;&#xFF0C;&#x8D44;&#x6599;&#x5F88;&#x96BE;&#x957F;&#x671F;&#x4FDD;&#x5B58;&#x3002;</li>
<li>&#x7F51;&#x7AD9;&#x96BE;&#x770B;&#x3002;&#x5F88;&#x591A;&#x7F51;&#x7AD9;&#x535A;&#x5BA2;&#x53EA;&#x63D0;&#x4F9B;&#x4E00;&#x4E9B;&#x96BE;&#x770B;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x4F60;&#x5F88;&#x96BE;&#x5B9A;&#x5236;&#x597D;&#x770B;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x5927;&#x90E8;&#x5206;&#x8FD9;&#x4E9B;&#x96BE;&#x770B;&#x7684;&#x4E3B;&#x9898;&#x5BF9;&#x79FB;&#x52A8;&#x7EC8;&#x7AEF;&#x8FD8;&#x4E0D;&#x53CB;&#x597D;&#x3002;</li>
<li>&#x6587;&#x7AE0;&#x53D1;&#x5E03;&#x6D41;&#x7A0B;&#x7E41;&#x7410;&#x3002;&#x5F88;&#x591A;&#x7F51;&#x7AD9;&#x7684;&#x7F16;&#x8F91;&#x5199;&#x4F5C;&#x754C;&#x9762;&#x90FD;&#x5F88;&#x7CDF;&#x7CD5;&#xFF0C;&#x53D1;&#x5E03;&#x8D77;&#x6765;&#x8FD8;&#x5F88;&#x9EBB;&#x70E6;&#xFF0C;&#x5982;&#x679C;&#x80FD;&#x901A;&#x8FC7;&#x7B80;&#x5355;&#x7684;&#x547D;&#x4EE4;&#x5C31;&#x53EF;&#x4EE5;&#x53D1;&#x5E03;&#x4E0A;&#x53BB;&#x662F;&#x591A;&#x4E48;&#x4F18;&#x96C5;&#x7684;&#x4E8B;&#x60C5;&#x3002;</li>
<li>&#x4E0D;&#x652F;&#x6301;&#x81EA;&#x5B9A;&#x4E49;&#x57DF;&#x540D;&#x3002;&#x96BE;&#x4EE5;&#x4E2A;&#x6027;&#x5316;&#x7684;&#x57DF;&#x540D;&#x5F88;&#x96BE;&#x4F53;&#x73B0;&#x4E2A;&#x4EBA;&#x7684;&#x54C1;&#x724C;&#x3002;</li>
<li>&#x53D7;&#x9650;&#x7684;&#x5199;&#x4F5C;&#x73AF;&#x5883;&#x3002;&#x4E00;&#x4E9B;&#x7F51;&#x7AD9;&#x4E3A;&#x4E86;&#x901A;&#x8FC7;&#x653F;&#x5E9C;&#x90E8;&#x95E8;&#x7684;&#x5185;&#x5BB9;&#x5BA1;&#x67E5;&#xFF0C;&#x4F60;&#x5199;&#x7684;&#x5185;&#x5BB9;&#x5F88;&#x53EF;&#x80FD;&#x4E0D;&#x7ECF;&#x610F;&#x88AB;&#x5F3A;&#x5236;&#x5220;&#x9664;&#xFF0C;&#x603B;&#x4E4B;&#x5728;&#x522B;&#x4EBA;&#x7684;&#x5730;&#x76D8;&#x4E0A;&#x4F60;&#x7684;&#x4E1C;&#x897F;&#x4E0D;&#x4E00;&#x5B9A;&#x662F;&#x4F60;&#x7684;&#x3002;</li>
</ol>
<p>&#x4EE5;&#x4E0A;&#x5C31;&#x662F;&#x53EF;&#x80FD;&#x5B58;&#x5728;&#x7684;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x6211;&#x7406;&#x60F3;&#x7684;&#x5199;&#x4F5C;&#x73AF;&#x5883;&#x5E94;&#x8BE5;&#x662F;&#x53EF;&#x4EE5;&#x89E3;&#x51B3;&#x4E0A;&#x8FF0;&#x51E0;&#x4E2A;&#x95EE;&#x9898;&#x7684;&#xFF0C;&#x4E0B;&#x9762;&#x6211;&#x901A;&#x8FC7;&#x51E0;&#x6B65;&#x6765;&#x6253;&#x9020;&#x4E00;&#x4E2A;&#x4E13;&#x5C5E;&#x4E8E;&#x6211;&#x4EEC;&#x81EA;&#x5DF1;&#x7684;&#x4F18;&#x96C5;&#x7684;&#x5199;&#x4F5C;&#x53D1;&#x5E03;&#x73AF;&#x5883;&#x3002;</p>
<h3 id="u73AF_u5883_u642D_u5EFA"><a href="#u73AF_u5883_u642D_u5EFA" class="headerlink" title="&#x73AF;&#x5883;&#x642D;&#x5EFA;"></a>&#x73AF;&#x5883;&#x642D;&#x5EFA;</h3><h4 id="u535A_u5BA2_u7CFB_u7EDF_uFF08Hexo_uFF09__26amp_3B__u4E3B_u9898_uFF08Next_uFF09"><a href="#u535A_u5BA2_u7CFB_u7EDF_uFF08Hexo_uFF09__26amp_3B__u4E3B_u9898_uFF08Next_uFF09" class="headerlink" title="&#x535A;&#x5BA2;&#x7CFB;&#x7EDF;&#xFF08;Hexo&#xFF09; &amp; &#x4E3B;&#x9898;&#xFF08;Next&#xFF09;"></a>&#x535A;&#x5BA2;&#x7CFB;&#x7EDF;&#xFF08;Hexo&#xFF09; &amp; &#x4E3B;&#x9898;&#xFF08;Next&#xFF09;</h4><p>&#x9996;&#x5148;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x535A;&#x5BA2;&#x7CFB;&#x7EDF;&#xFF0C;&#x76EE;&#x524D;&#x5E02;&#x573A;&#x4E0A;&#x5B58;&#x5728;&#x5F88;&#x591A;&#x5B8C;&#x6574;&#x7684;&#x535A;&#x5BA2;&#x7CFB;&#x7EDF;&#xFF1A;&#x5982;Wordpress&#x6216;&#x4E00;&#x4E9B;CMS&#x7CFB;&#x7EDF;&#x7B49;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x4E9B;&#x7CFB;&#x7EDF;&#x90FD;&#x592A;&#x5927;&#xFF0C;&#x5F88;&#x81C3;&#x80BF;&#x3002;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x8F7B;&#x91CF;&#x7EA7;&#x522B;&#x7684;&#x535A;&#x5BA2;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E76;&#x4E14;&#x80FD;&#x914D;&#x5408;GitHub Pages&#x6765;&#x7BA1;&#x7406;&#x6211;&#x4EEC;&#x7684;&#x6587;&#x7AE0;&#x53CA;&#x76F8;&#x5173;&#x4FE1;&#x606F;&#x3002;Hexo&#x5C31;&#x662F;&#x4E00;&#x4E2A;&#x6EE1;&#x8DB3;&#x6211;&#x4EEC;&#x9700;&#x6C42;&#x7684;&#x535A;&#x5BA2;&#x7CFB;&#x7EDF;&#x3002;<br>&#x5728;Mac&#x4E0B;&#x901A;&#x8FC7;&#x547D;&#x4EE4;&#x884C;&#x5B89;&#x88C5;&#xFF1A;<br><figure class="highlight sql"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">npm <span class="operator"><span class="keyword">install</span> hexo-cli -<span class="keyword">g</span></span><br><span class="line">hexo init blog</span><br><span class="line">cd blog</span><br><span class="line">npm <span class="keyword">install</span></span><br><span class="line">hexo <span class="keyword">server</span></span></span><br></pre></td></tr></table></figure></p>
<blockquote>
<p>&#x5982;&#x679C;&#x662F;Windows&#x6216;&#x8005;Linux&#x7CFB;&#x7EDF;&#x4E5F;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5982;&#x4E0B;&#x547D;&#x4EE4;&#x6765;&#x5B89;&#x88C5;&#xFF0C;Windows&#x7CFB;&#x7EDF;&#x9700;&#x8981;&#x63D0;&#x524D;&#x5B89;&#x88C5;&#x597D;NPM&#x8F6F;&#x4EF6;&#x5305;&#xFF0C;&#x5B89;&#x88C5;&#x6D41;&#x7A0B;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;Google&#x6216;&#x8005;&#x5B98;&#x65B9;&#x6587;&#x6863;&#x6765;&#x67E5;&#x770B;&#x3002;</p>
</blockquote>
<p>&#x8FD9;&#x65F6;&#x5019;&#x4F60;&#x5DF2;&#x7ECF;&#x90E8;&#x7F72;&#x597D;&#x4E86;Hexo&#x535A;&#x5BA2;&#x7CFB;&#x7EDF;&#xFF0C;&#x5E76;&#x4E14;&#x521D;&#x59CB;&#x5316;&#x597D;&#x4E86;&#x535A;&#x5BA2;&#x7CFB;&#x7EDF;&#x6240;&#x9700;&#x7684;&#x6587;&#x4EF6;&#xFF0C;blog&#x5C31;&#x662F;&#x4F60;&#x7684;&#x535A;&#x5BA2;&#x6839;&#x76EE;&#x5F55;&#x3002;&#x8FD9;&#x65F6;&#x5019;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5B89;&#x88C5;&#x4E00;&#x6B3E;&#x540D;&#x4E3A;Next&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x8FD9;&#x4E2A;&#x4E3B;&#x9898;&#x4E5F;&#x662F;&#x672C;&#x535A;&#x5BA2;&#x76EE;&#x524D;&#x4F7F;&#x7528;&#x7684;&#x4E3B;&#x9898;&#xFF0C;&#x4F60;&#x4E5F;&#x53EF;&#x4EE5;&#x9009;&#x62E9;&#x4F60;&#x81EA;&#x5DF1;&#x559C;&#x6B22;&#x7684;&#x4E3B;&#x9898;&#x3002;Next&#x4E3B;&#x9898;&#x5F88;&#x5F3A;&#x5927;&#xFF0C;&#x54CD;&#x5E94;&#x5F0F;&#x8BBE;&#x8BA1;&#x5E76;&#x4E14;&#x652F;&#x6301;&#x5F88;&#x591A;&#x7B2C;&#x4E09;&#x65B9;&#x670D;&#x52A1;&#x7684;&#x7279;&#x6027;&#xFF0C;&#x8FD9;&#x4E2A;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x5B98;&#x7F51;<a href="http://theme-next.iissnan.com/five-minutes-setup.html" title="[external]" target="_blank" rel="external">Hexo</a>&#x6765;&#x67E5;&#x770B;&#x3002;</p>
<p>&#x7ECF;&#x8FC7;Next&#x4E3B;&#x9898;&#x5B98;&#x65B9;&#x6587;&#x6863;&#x7684;&#x6307;&#x5BFC;&#x540E;&#xFF0C;&#x76F8;&#x4FE1;&#x4F60;&#x5DF2;&#x7ECF;&#x914D;&#x7F6E;&#x597D;&#x4E86;&#x8BE5;&#x4E3B;&#x9898;&#x3002;&#x90A3;&#x76EE;&#x524D;&#x6211;&#x4EEC;&#x5DF2;&#x7ECF;&#x5B8C;&#x6210;&#x4E86;&#x535A;&#x5BA2;&#x7CFB;&#x7EDF;&#x548C;&#x4E3B;&#x9898;&#x7684;&#x914D;&#x7F6E;&#xFF0C;&#x63A5;&#x4E0B;&#x6765;&#x9700;&#x8981;&#x628A;&#x535A;&#x5BA2;&#x7CFB;&#x7EDF;&#x53D1;&#x5E03;&#x5230;&#x4E92;&#x8054;&#x7F51;&#x4E0A;&#xFF0C;&#x8FD9;&#x6837;&#x6240;&#x6709;&#x4EBA;&#x5C31;&#x53EF;&#x4EE5;&#x6765;&#x8BBF;&#x95EE;&#x6211;&#x4EEC;&#x7684;&#x535A;&#x5BA2;&#x4E86;&#x3002;</p>
<h4 id="u7CFB_u7EDF_u90E8_u7F72_uFF08GitHub_Pages_uFF09"><a href="#u7CFB_u7EDF_u90E8_u7F72_uFF08GitHub_Pages_uFF09" class="headerlink" title="&#x7CFB;&#x7EDF;&#x90E8;&#x7F72;&#xFF08;GitHub Pages&#xFF09;"></a>&#x7CFB;&#x7EDF;&#x90E8;&#x7F72;&#xFF08;GitHub Pages&#xFF09;</h4><p>&#x5982;&#x679C;&#x662F;&#x4F20;&#x7EDF;&#x7684;&#x4E2A;&#x4EBA;&#x535A;&#x5BA2;&#x7684;&#x8BDD;&#xFF0C;&#x4E00;&#x822C;&#x9700;&#x8981;&#x79DF;&#x4E00;&#x53F0;&#x5728;&#x7EBF;&#x7684;VPS&#x7CFB;&#x7EDF;&#x6216;&#x8005;&#x7A7A;&#x95F4;&#x6765;&#x5B58;&#x653E;&#x6211;&#x4EEC;&#x7684;&#x8F6F;&#x4EF6;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x4F60;&#x9700;&#x8981;&#x64CD;&#x5FC3;&#x5F88;&#x591A;&#x4E8B;&#x60C5;&#x4E86;&#xFF0C;&#x4E0D;&#x4EC5;&#x9700;&#x8981;&#x81EA;&#x5DF1;&#x7EF4;&#x62A4;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x8FD8;&#x9700;&#x8981;&#x6BCF;&#x6708;&#x4ED8;&#x8D39;&#x4F9B;&#x517B;&#x670D;&#x52A1;&#x5668;&#xFF0C;&#x6BD4;&#x8F83;&#x9EBB;&#x70E6;&#x3002;&#x6211;&#x4EEC;&#x6709;&#x66F4;&#x597D;&#x66F4;&#x4F18;&#x96C5;&#x7684;&#x65B9;&#x5F0F;&#xFF0C;&#x5C31;&#x662F;&#x901A;&#x8FC7;GitHub Pages&#x6765;&#x5B58;&#x653E;&#x6211;&#x4EEC;&#x7684;&#x535A;&#x5BA2;&#x7CFB;&#x7EDF;&#x3002;&#x5177;&#x4F53;&#x5B89;&#x88C5;&#x4ECB;&#x7ECD;&#x53EF;&#x4EE5;&#x770B;&#x5B98;&#x7F51;<a href="https://pages.github.com/" title="[external]" target="_blank" rel="external">GitHub Pages</a>&#x3002;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x6211;&#x4EEC;&#x9700;&#x8981;GitHub Pages&#x6765;&#x90E8;&#x7F72;&#x6211;&#x4EEC;&#x7684;&#x7CFB;&#x7EDF;&#xFF0C;&#x4E00;&#x65B9;&#x9762;&#x662F;&#x56E0;&#x4E3A;GitHub Pages&#x662F;&#x514D;&#x8D39;&#x7684;&#xFF0C;&#x5F88;&#x591A;&#x670D;&#x52A1;&#x5668;&#x7684;&#x7EF4;&#x62A4;&#x90FD;&#x4E0D;&#x9700;&#x8981;&#x4F60;&#x64CD;&#x5FC3;&#xFF0C;&#x66F4;&#x91CD;&#x8981;&#x7684;&#x4E00;&#x65B9;&#x9762;&#x662F;&#x4F60;&#x53EF;&#x4EE5;&#x7528;Git&#x6765;&#x7BA1;&#x7406;&#x4F60;&#x7684;&#x535A;&#x5BA2;&#xFF0C;&#x901A;&#x8FC7;&#x51E0;&#x6761;&#x7B80;&#x5355;&#x7684;&#x547D;&#x4EE4;&#x5C31;&#x53EF;&#x4EE5;&#x53D1;&#x5E03;&#x3001;&#x56DE;&#x6EDA;&#x4E4B;&#x524D;&#x7248;&#x672C;&#x6765;&#x7BA1;&#x7406;&#x4F60;&#x7684;&#x535A;&#x5BA2;&#x7F51;&#x7AD9;&#x3002;<br><figure class="highlight xquery"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br></pre></td><td class="code"><pre><span class="line">git add --all</span><br><span class="line">~<span class="variable">$git</span> commit -m <span class="string">&quot;Initial commit&quot;</span></span><br><span class="line">~<span class="variable">$git</span> push -u origin master</span><br></pre></td></tr></table></figure><br>&#x4E0A;&#x9762;&#x7684;&#x547D;&#x4EE4;&#x5C31;&#x662F;&#x5728;&#x4F60;&#x7684;blog&#x76EE;&#x5F55;&#x91CC;&#x9762;&#x64CD;&#x4F5C;&#x7684;&#xFF0C;&#x4E00;&#x65E6;&#x4F60;&#x6CE8;&#x518C;&#x597D;&#x4E86;&#x4E00;&#x4E2A;GitHub&#x5E10;&#x53F7;&#x540E;&#xFF0C;&#x5728;&#x4E0A;&#x9762;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x4ED3;&#x5E93;&#xFF08;repository&#xFF09;&#x540E;&#xFF0C;&#x5728;&#x4F60;&#x8BA1;&#x7B97;&#x4E0A;&#x8BBE;&#x7F6E;&#x597D;SSH Key&#x6765;&#x6253;&#x901A;&#x548C;GitHub&#x4ED3;&#x5E93;&#x7684;&#x901A;&#x9053;&#x540E;&#xFF0C;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4E0A;&#x8FF0;&#x51E0;&#x6761;&#x547D;&#x4EE4;&#x6765;&#x628A;&#x4F60;&#x672C;&#x5730;&#x7684;&#x4EE3;&#x7801;&#x4E0A;&#x4F20;&#x540C;&#x6B65;&#x5230;&#x4ED3;&#x5E93;&#x91CC;&#x9762;&#x53BB;&#x3002;&#x7528;&#x4EBA;&#x8BDD;&#x8BB2;&#x5C31;&#x662F;&#xFF0C;&#x4F60;&#x901A;&#x8FC7;&#x90A3;&#x51E0;&#x6761;&#x547D;&#x4EE4;&#x628A;&#x4F60;&#x7684;&#x7F51;&#x7AD9;&#x4E0A;&#x4F20;&#x5230;GitHub&#x7684;&#x7F51;&#x7AD9;&#x4E0A;&#x53BB;&#x4E86;&#x3002;&#x7136;&#x540E;&#x4F60;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#xFF1A; <a href="http://username.github.io" target="_blank" rel="external">http://username.github.io</a> &#xFF0C;&#x8FD9;&#x7F51;&#x5740;&#x5C31;&#x662F;&#x4F60;&#x7684;&#x535A;&#x5BA2;&#x5730;&#x5740;&#xFF0C;&#x9700;&#x8981;&#x628A;&#x91CC;&#x9762;&#x7684;username&#x66FF;&#x6362;&#x4E3A;&#x4F60;&#x7684;GitHub&#x8D26;&#x6237;&#x540D;&#x3002;</p>
<h4 id="u57DF_u540D_u7ED1_u5B9A"><a href="#u57DF_u540D_u7ED1_u5B9A" class="headerlink" title="&#x57DF;&#x540D;&#x7ED1;&#x5B9A;"></a>&#x57DF;&#x540D;&#x7ED1;&#x5B9A;</h4><p>&#x6BD5;&#x7ADF; <a href="http://username.github.io" target="_blank" rel="external">http://username.github.io</a> &#x8FD9;&#x79CD;&#x57DF;&#x540D;&#x65E0;&#x6CD5;&#x4F53;&#x73B0;&#x6211;&#x4EEC;&#x5BF9;&#x903C;&#x683C;&#xFF0C;&#x53EF;&#x4EE5;&#x5728;Godaddy&#x6216;&#x8005;&#x4E07;&#x7F51;&#x6CE8;&#x518C;&#x4E00;&#x4E2A;&#x57DF;&#x540D;&#x53BB;&#xFF0C;&#x53EF;&#x4EE5;&#x4EE5;&#x4F60;&#x7684;&#x540D;&#x5B57;&#x6765;&#x6CE8;&#x518C;&#xFF0C;&#x4E00;&#x822C;&#x77ED;&#x7684;&#x90FD;&#x6CE8;&#x518C;&#x4E0D;&#x5230;&#x4E86;&#x3002;&#x4E07;&#x7F51;&#x7684;&#x57DF;&#x540D;&#x5982;&#x679C;&#x6258;&#x7BA1;&#x5230;&#x963F;&#x91CC;&#x4E91;&#x5230;&#x8BDD;&#x9700;&#x8981;&#x5907;&#x6848;&#xFF0C;&#x81F3;&#x4E8E;&#x5907;&#x6848;&#x6D41;&#x7A0B;&#x7684;&#x8BDD;&#x963F;&#x91CC;&#x4E91;&#x4F1A;&#x6709;&#x76F8;&#x5173;&#x7684;&#x6D41;&#x7A0B;&#x5E2E;&#x4F60;&#x505A;&#xFF0C;&#x5927;&#x6982;&#x9700;&#x8981;&#x534A;&#x4E2A;&#x6708;&#x4E4B;&#x4E45;&#x3002;&#x5907;&#x6848;&#x540E;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x5728;&#x57DF;&#x540D;&#x7BA1;&#x7406;&#x91CC;&#x628A;&#x57DF;&#x540D;&#x89E3;&#x6790;&#x5230; <a href="http://username.github.io" target="_blank" rel="external">http://username.github.io</a> &#xFF0C;&#x5982;&#x679C;&#x89C9;&#x5F97;&#x4E07;&#x7F51;&#x7684;DNS&#x4E0D;&#x597D;&#x7684;&#x8BDD;&#x53EF;&#x4EE5;&#x628A;DNS&#x89E3;&#x6790;&#x653E;&#x5230;DNSNode&#x4E0A;&#x9762;&#x53BB;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x91CC;&#x9762;&#x8BBE;&#x7F6E;CNAME&#x5B50;&#x57DF;&#x540D;&#x3002;<br><img src="http://7xqna7.com1.z0.glb.clouddn.com/dnsnode.jpg" alt="dnsnode"><br>&#x7136;&#x540E;&#x5728;blog&#x76EE;&#x5F55;&#x91CC;&#x9762;&#x7684;source&#x76EE;&#x5F55;&#x4E0B;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;CNAME&#x6587;&#x4EF6;&#xFF0C;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#x5C31;&#x662F;&#x4F60;&#x81EA;&#x5DF1;&#x7684;&#x57DF;&#x540D;&#x3002;<br><img src="http://7xqna7.com1.z0.glb.clouddn.com/cname.jpg" alt="cname"><br>&#x8FD9;&#x6837;&#x4F60;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x8BBF;&#x95EE;&#x4F60;&#x7684;&#x57DF;&#x540D;&#x5C31;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x4F60;&#x7684;&#x535A;&#x5BA2;&#x4E86;&#x3002;&#x5B9E;&#x9645;&#x4E0A;&#x505A;&#x4E86;&#x4E00;&#x6B21;&#x8DF3;&#x8F6C;&#x3002;</p>
<h4 id="u8FD0_u8425_u7EDF_u8BA1"><a href="#u8FD0_u8425_u7EDF_u8BA1" class="headerlink" title="&#x8FD0;&#x8425;&#x7EDF;&#x8BA1;"></a>&#x8FD0;&#x8425;&#x7EDF;&#x8BA1;</h4><p>&#x63A5;&#x4E0B;&#x6765;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x5BF9;&#x535A;&#x5BA2;&#x548C;&#x4E3B;&#x9898;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x914D;&#x7F6E;&#xFF0C;&#x4EE5;&#x8FBE;&#x5230;&#x66F4;&#x597D;&#x7684;&#x4E00;&#x4E9B;&#x6548;&#x679C;&#xFF0C;&#x6BD4;&#x5982;&#x8BC4;&#x8BBA;&#x5206;&#x4EAB;&#xFF08;&#x591A;&#x8BF4;&#xFF09;&#x3001;&#x6587;&#x7AE0;&#x9605;&#x8BFB;&#x6B21;&#x6570;&#xFF08;LeanCloud&#xFF09;&#x3001;&#x6587;&#x7AE0;&#x5206;&#x7C7B;&#x6807;&#x7B7E;&#x3001;&#x4FA7;&#x8FB9;&#x680F;&#x7684;&#x8BBE;&#x7F6E;&#x3001;&#x7B2C;&#x4E09;&#x65B9;&#x670D;&#x52A1;&#x7684;&#x914D;&#x7F6E;&#xFF08;Google Webmaster &amp; Analytics&#x3001;&#x817E;&#x8BAF;&#x7AD9;&#x70B9;&#x5206;&#x6790;&#xFF09;&#x3002;&#x8FD9;&#x65B9;&#x9762;&#x53EF;&#x4EE5;&#x770B;Next&#x4E3B;&#x9898;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x6863;&#x3002;<br>&#x5927;&#x6982;&#x8BF4;&#x4E0B;&#x6D41;&#x7A0B;&#xFF0C;&#x8BC4;&#x8BBA;&#x53EF;&#x4EE5;&#x5728;Next&#x4E3B;&#x9898;&#x91CC;&#x9762;&#x542F;&#x7528;&#x591A;&#x8BF4;&#x8BC4;&#x8BBA;&#x7CFB;&#x7EDF;&#xFF08;&#x4F60;&#x9700;&#x8981;&#x6CE8;&#x518C;&#x4E00;&#x4E2A;&#x591A;&#x8BF4;&#x8D26;&#x6237;&#xFF09;&#xFF0C;&#x6587;&#x7AE0;&#x9605;&#x8BFB;&#x6B21;&#x6570;&#x53EF;&#x4EE5;&#x53C2;&#x8003;&#x8FD9;&#x7BC7;<a href="http://notes.xiamo.tk/2015-10-21-%E4%B8%BANexT%E4%B8%BB%E9%A2%98%E6%B7%BB%E5%8A%A0%E6%96%87%E7%AB%A0%E9%98%85%E8%AF%BB%E9%87%8F%E7%BB%9F%E8%AE%A1%E5%8A%9F%E8%83%BD.html" title="[external]" target="_blank" rel="external">&#x6587;&#x7AE0;</a>&#x3002;&#x6587;&#x7AE0;&#x5206;&#x7C7B;&#x6807;&#x7B7E;&#x53EF;&#x4EE5;&#x5728;&#x7528;Hexo&#x547D;&#x4EE4;&#x6765;&#x65B0;&#x5EFA;&#x5206;&#x7C7B;&#x548C;&#x6807;&#x7B7E;&#x9875;&#x9762;&#xFF0C;&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x53C2;&#x8003;Hexo&#x5B98;&#x65B9;&#x6587;&#x6863;&#xFF0C;&#x5982;&#x679C;&#x4F60;&#x60F3;&#x5BF9;&#x4E3B;&#x9898;CSS&#x7B49;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x4E00;&#x4E9B;&#x4FEE;&#x6539;&#x540E;&#x53D1;&#x73B0;&#x5E76;&#x6CA1;&#x6709;&#x6548;&#x679C;&#x7684;&#x8BDD;&#xFF0C;&#x90A3;&#x53EF;&#x4EE5;&#x5148;&#x6E05;&#x7A7A;Hexo&#x6570;&#x636E;&#x5E93;&#x548C;&#x4EA7;&#x751F;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x8FDB;&#x5165;blog&#x76EE;&#x5F55;&#x5728;&#x547D;&#x4EE4;&#x884C;&#x6267;&#x884C;&#xFF1A;<br><figure class="highlight nginx"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line"><span class="title">hexo</span> clean <span class="comment">#&#x6E05;&#x7A7A;Hexo&#x6570;&#x636E;&#x5E93;&#x548C;&#x4EA7;&#x751F;&#x7684;&#x6587;&#x4EF6;</span></span><br><span class="line">hexo d -g <span class="comment">#&#x91CD;&#x65B0;&#x4EA7;&#x751F;&#x535A;&#x5BA2;&#x6587;&#x7AE0;&#x5E76;&#x53D1;&#x5E03;&#x5230;GitHub&#xFF0C;&#x524D;&#x63D0;&#x5F97;&#x5728;Hexo&#x91CC;&#x914D;&#x7F6E;&#x597D;GitHub&#x8D26;&#x6237;</span></span><br></pre></td></tr></table></figure><br>&#x4FA7;&#x8FB9;&#x680F;&#x5F97;&#x914D;&#x7F6E;&#x53EF;&#x4EE5;&#x5728;Next&#x4E3B;&#x9898;&#x91CC;&#x9762;&#x914D;&#x7F6E;&#x3002;&#x7B2C;&#x4E09;&#x65B9;&#x670D;&#x52A1;&#x7B49;&#x90FD;&#x53EF;&#x4EE5;&#x53C2;&#x8003;Next&#x4E3B;&#x9898;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x6863;&#x3002;&#x8FD9;&#x6837;&#x901A;&#x8FC7;Google&#x7684;Webmaster&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x4F60;&#x7684;&#x7AD9;&#x70B9;&#x8BBE;&#x7F6E;&#x7684;&#x5BF9;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x66F4;&#x53CB;&#x597D;&#xFF0C;&#x8FD9;&#x6837;&#x522B;&#x4EBA;&#x5C31;&#x53EF;&#x4EE5;&#x65B9;&#x4FBF;&#x7684;&#x901A;&#x8FC7;&#x641C;&#x7D22;&#x5F15;&#x64CE;&#x627E;&#x5230;&#x4F60;&#x7684;&#x6587;&#x7AE0;&#x4E86;&#xFF0C;&#x63D0;&#x9AD8;&#x6D41;&#x91CF;&#x4E86;&#x3002;&#x540C;&#x65F6;&#x8BBE;&#x7F6E;&#x817E;&#x8BAF;&#x5206;&#x6790;&#x548C;Google Analytics&#x53EF;&#x4EE5;&#x8BA9;&#x4F60;&#x5F88;&#x65B9;&#x4FBF;&#x7684;&#x4E86;&#x89E3;&#x7F51;&#x7AD9;&#x7684;&#x6D41;&#x91CF;&#x548C;&#x8BBF;&#x95EE;&#x60C5;&#x51B5;&#x7B49;&#x3002;&#x817E;&#x8BAF;&#x5206;&#x6790;&#x53EF;&#x4EE5;&#x6BCF;&#x5929;&#x6216;&#x6BCF;&#x5468;&#x8BA2;&#x9605;&#x7F51;&#x7AD9;&#x7EDF;&#x8BA1;&#x5206;&#x6790;&#x62A5;&#x544A;&#x3002;</p>
<h3 id="u5199_u4F5C_u53D1_u5E03"><a href="#u5199_u4F5C_u53D1_u5E03" class="headerlink" title="&#x5199;&#x4F5C;&#x53D1;&#x5E03;"></a>&#x5199;&#x4F5C;&#x53D1;&#x5E03;</h3><p>&#x641E;&#x5B9A;&#x4E86;&#x70E6;&#x4EBA;&#x7684;&#x73AF;&#x5883;&#x914D;&#x7F6E;&#x540E;&#xFF0C;&#x6211;&#x4EEC;&#x5F00;&#x59CB;&#x4E86;&#x6700;&#x91CD;&#x8981;&#x7684;&#x90E8;&#x5206;&#xFF1A;&#x5199;&#x4F5C;&#xFF01;&#x4E00;&#x5207;&#x90FD;&#x662F;&#x4E3A;&#x4E86;&#x66F4;&#x4F18;&#x96C5;&#x7684;&#x5199;&#x4F5C;&#x3002;</p>
<h4 id="Markdown_u8BED_u6CD5"><a href="#Markdown_u8BED_u6CD5" class="headerlink" title="Markdown&#x8BED;&#x6CD5;"></a>Markdown&#x8BED;&#x6CD5;</h4><p>Hexo&#x535A;&#x5BA2;&#x7CFB;&#x7EDF;&#x7684;&#x5199;&#x4F5C;&#x65B9;&#x5F0F;&#x5F88;&#x7B80;&#x5355;&#xFF0C;&#x901A;&#x8FC7;Markdown&#x8BED;&#x6CD5;&#x6765;&#x5199;&#x4F5C;&#x3002;&#x9996;&#x5148;&#x8BA9;&#x6211;&#x4EEC;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x6587;&#x7AE0;&#x5427;&#x3002;<br><figure class="highlight axapta"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br></pre></td><td class="code"><pre><span class="line">hexo <span class="keyword">new</span> title <span class="preprocessor">#title&#x662F;&#x4F60;&#x7684;&#x5199;&#x4F5C;</span></span><br><span class="line">hexo d -g <span class="preprocessor">#&#x91CD;&#x65B0;&#x4EA7;&#x751F;&#x535A;&#x5BA2;&#x6587;&#x7AE0;&#x5E76;&#x53D1;&#x5E03;&#x5230;GitHub&#xFF0C;&#x524D;&#x63D0;&#x5F97;&#x5728;Hexo&#x91CC;&#x914D;&#x7F6E;&#x597D;GitHub&#x8D26;&#x6237;</span></span><br></pre></td></tr></table></figure><br>&#x8FD9;&#x6837;&#x5728;blog/source/_post&#x76EE;&#x5F55;&#x5C31;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;title&#x7684;md&#x6587;&#x4EF6;&#xFF0C;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x5C31;&#x662F;&#x6211;&#x4EEC;&#x8981;&#x5199;&#x4F5C;&#x7684;&#xFF0C;&#x5F53;&#x7136;&#x6709;&#x4E2A;&#x5C0F;&#x9EBB;&#x70E6;&#x5728;&#x4E8E;&#x4F60;&#x6BCF;&#x6B21;&#x6572;&#x5B8C;&#x547D;&#x4EE4;&#x90FD;&#x9700;&#x8981;&#x53BB;&#x627E;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#xFF0C;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;&#x7684;&#x8BBE;&#x7F6E;&#x6765;&#x8BA9;hexo&#x7CFB;&#x7EDF;&#x81EA;&#x52A8;&#x7528;&#x8F6F;&#x4EF6;&#x6765;&#x7ED9;&#x6211;&#x4EEC;&#x6253;&#x5F00;&#x8FD9;&#x4E2A;&#x8981;&#x5199;&#x4F5C;&#x7684;&#x6587;&#x4EF6;&#x3002;&#x9996;&#x5148;&#x5728;blog&#x76EE;&#x524D;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;scripts&#x7684;&#x76EE;&#x5F55;&#xFF0C;&#x7136;&#x540E;&#x5728;&#x91CC;&#x9762;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;open-tools.js&#x7684;&#x6587;&#x4EF6;&#xFF0C;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#x5982;&#x4E0B;&#xFF1A;<br><figure class="highlight oxygene"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line"><span class="keyword">var</span> exec = <span class="keyword">require</span>(<span class="string">&apos;child_process&apos;</span>).exec;</span><br><span class="line"><span class="comment">// Hexo 3</span></span><br><span class="line">hexo.<span class="keyword">on</span>(<span class="string">&apos;new&apos;</span>, <span class="function"><span class="keyword">function</span><span class="params">(data)</span><span class="comment">{</span><br><span class="line">    exec(&apos;open -a &quot;/Applications/Mou.app&quot; &apos; + data.path);</span><br><span class="line">}</span>);</span></span><br></pre></td></tr></table></figure><br>&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x7684;&#x610F;&#x601D;&#x5C31;&#x662F;&#x65B0;&#x5EFA;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x540E;hexo&#x4F1A;&#x81EA;&#x52A8;&#x7528;Mou&#x8FD9;&#x4E2A;app&#x6765;&#x6253;&#x5F00;&#x8FD9;&#x4E2A;md&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x7528;Mou&#x8FD9;&#x4E2A;Markdown&#x7F16;&#x8F91;&#x8F6F;&#x4EF6;&#x6765;&#x5199;&#x4F5C;&#x4E86;&#x3002;<br>&#x81F3;&#x4E8E;Markdown&#x8BED;&#x6CD5;&#x600E;&#x4E48;&#x641E;&#xFF0C;&#x7F51;&#x4E0A;&#x6709;&#x5F88;&#x591A;&#x6559;&#x7A0B;&#xFF0C;&#x4F46;&#x662F;&#x4E3A;&#x4E86;&#x76F4;&#x89C2;&#x7684;&#x7ED9;&#x4F60;&#x4E00;&#x4E2A;&#x611F;&#x53D7;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x770B;&#x6211;&#x4E0A;&#x4E00;&#x7BC7;&#x6587;&#x7AE0;&#x7684;md&#x6587;&#x4EF6;&#xFF0C;&#x7136;&#x540E;&#x5BF9;&#x6BD4;&#x4E0B;&#x8F93;&#x51FA;&#x7684;&#x6587;&#x7AE0;&#x5C31;&#x5927;&#x6982;&#x7406;&#x89E3;Markdown&#x7684;&#x7CBE;&#x9AD3;&#x4E86;&#x3002;<br>&#x6E90;&#x6587;&#x4EF6;&#xFF1A;<a href="https://raw.githubusercontent.com/madawei2699/hexo-myblog/master/source/_posts/20160131.md" title="[external]" target="_blank" rel="external">&#x6253;&#x9020;&#x4F18;&#x96C5;&#x9AD8;&#x6548;&#x7684;Mac&#x5DE5;&#x4F5C;&#x73AF;&#x5883;</a><br>&#x8F93;&#x51FA;&#x6548;&#x679C;&#xFF1A;<a href="http://madawei.net/2016/01/31/20160131/" title="[external]">&#x6253;&#x9020;&#x4F18;&#x96C5;&#x9AD8;&#x6548;&#x7684;Mac&#x5DE5;&#x4F5C;&#x73AF;&#x5883;</a> </p>
<h4 id="u7F16_u8F91_u5DE5_u5177"><a href="#u7F16_u8F91_u5DE5_u5177" class="headerlink" title="&#x7F16;&#x8F91;&#x5DE5;&#x5177;"></a>&#x7F16;&#x8F91;&#x5DE5;&#x5177;</h4><p>&#x76EE;&#x524D;&#x6211;&#x7528;Mou&#x6765;&#x4E66;&#x5199;Markdown&#x6587;&#x4EF6;&#xFF0C;&#x754C;&#x9762;&#x957F;&#x8FD9;&#x6837;&#xFF1A;<br><img src="http://7xqna7.com1.z0.glb.clouddn.com/mou.png" alt="Mou"></p>
<h4 id="u5199_u4F5C_u53D1_u5E03_u6D41_u7A0B"><a href="#u5199_u4F5C_u53D1_u5E03_u6D41_u7A0B" class="headerlink" title="&#x5199;&#x4F5C;&#x53D1;&#x5E03;&#x6D41;&#x7A0B;"></a>&#x5199;&#x4F5C;&#x53D1;&#x5E03;&#x6D41;&#x7A0B;</h4><ol>
<li>&#x5728;Mac&#x6253;&#x5F00;iTerm&#x7EC8;&#x7AEF;<figure class="highlight bash"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line"><span class="built_in">cd</span> blog</span><br></pre></td></tr></table></figure></li>
<li>&#x65B0;&#x5EFA;&#x6587;&#x7AE0;&#x5E76;&#x7528;Mou&#x7F16;&#x5199;&#x6587;&#x7AE0;&#x5185;&#x5BB9;<figure class="highlight actionscript"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">hexo <span class="keyword">new</span> title</span><br></pre></td></tr></table></figure></li>
<li>&#x53D1;&#x5E03;&#x6587;&#x7AE0;&#x5230;GitHub Pages<figure class="highlight stata"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">hexo <span class="keyword">d</span> -<span class="keyword">g</span></span><br></pre></td></tr></table></figure></li>
<li>&#x4FEE;&#x6539;&#x6587;&#x7AE0;&#x540E;&#x7EE7;&#x7EED;&#x6267;&#x884C;&#x7B2C;3&#x6B65;&#x5373;&#x53EF;&#x91CD;&#x65B0;&#x53D1;&#x5E03;&#x4E0A;&#x53BB;</li>
</ol>
<h3 id="u7248_u672C_u7BA1_u7406"><a href="#u7248_u672C_u7BA1_u7406" class="headerlink" title="&#x7248;&#x672C;&#x7BA1;&#x7406;"></a>&#x7248;&#x672C;&#x7BA1;&#x7406;</h3><p>&#x5982;&#x679C;&#x6211;&#x4EEC;&#x60F3;&#x56DE;&#x5230;&#x67D0;&#x4E00;&#x4E2A;&#x5199;&#x4F5C;&#x7248;&#x672C;&#x7684;&#x8BDD;&#x4E5F;&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x7684;&#x901A;&#x8FC7;GitHub&#x4ED3;&#x5E93;&#x91CC;&#x9762;&#x8FDB;&#x884C;&#x56DE;&#x6EDA;&#x64CD;&#x4F5C;&#x3002;&#x6BCF;&#x6B21;&#x5F53;&#x6211;&#x4EEC;&#x6267;&#x884C;hexo d -g&#x547D;&#x4EE4;&#x7684;&#x65F6;&#x5019;&#x5B9E;&#x9645;&#x4E0A;&#x5C31;&#x662F;&#x4EA7;&#x751F;&#x4E00;&#x4E2A;&#x7248;&#x672C;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x767B;&#x9646;&#x5230;GitHub&#x4ED3;&#x5E93;&#x91CC;&#x9762;&#x770B;&#x5230;&#x6BCF;&#x6B21;&#x63D0;&#x4EA4;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x5F53;&#x7136;&#x8FD9;&#x4E2A;&#x4ED3;&#x5E93;&#x5B58;&#x653E;&#x7684;&#x662F;&#x5DF2;&#x7ECF;&#x4EA7;&#x751F;&#x7684;Html&#x6587;&#x4EF6;&#xFF0C;&#x4E5F;&#x5C31;&#x662F;&#x5728;blog&#x76EE;&#x5F55;&#x91CC;&#x9762;&#x7684;public&#x76EE;&#x5F55;&#xFF0C;&#x8FD9;&#x4E2A;&#x76EE;&#x5F55;&#x7684;&#x6240;&#x6709;&#x6587;&#x4EF6;&#x90FD;&#x4F1A;&#x88AB;&#x53D1;&#x5E03;&#x5230;GitHub&#x4ED3;&#x5E93;&#x91CC;&#x9762;&#x53BB;&#x3002;&#x4F46;&#x662F;source/_post&#x76EE;&#x5F55;&#x91CC;&#x9762;&#x5B58;&#x653E;&#x7684;&#x624D;&#x662F;&#x4F60;&#x771F;&#x6B63;&#x7684;&#x6E90;&#x6587;&#x4EF6;&#xFF0C;&#x90FD;&#x662F;&#x4E9B;md&#x6587;&#x4EF6;&#xFF0C;&#x90A3;&#x8FD9;&#x4E9B;&#x6587;&#x4EF6;&#x5E76;&#x6CA1;&#x6709;&#x88AB;GitHub&#x4ED3;&#x5E93;&#x7BA1;&#x7406;&#xFF0C;&#x6240;&#x4EE5;&#x4E3A;&#x4E86;&#x5BF9;&#x8FD9;&#x4E9B;&#x6E90;&#x6587;&#x4EF6;&#x8FDB;&#x884C;&#x7248;&#x672C;&#x7BA1;&#x7406;&#xFF0C;&#x4F60;&#x9700;&#x8981;&#x5728;GitHub&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#x4ED3;&#x5E93;&#x7528;&#x6765;&#x5B58;&#x653E;blog&#x76EE;&#x5F55;&#xFF0C;blog&#x76EE;&#x5F55;&#x91CC;&#x9762;&#x6709;&#x4E9B;&#x6587;&#x4EF6;&#x5E76;&#x4E0D;&#x9700;&#x8981;&#x53D1;&#x5E03;&#x5230;GitHub&#xFF0C;&#x8FD9;&#x4E9B;&#x4E0D;&#x9700;&#x8981;&#x7684;&#x6587;&#x4EF6;&#x4F60;&#x53EF;&#x4EE5;&#x5728;.gitignore&#xFF08;&#x5B58;&#x653E;&#x5728;blog&#x6839;&#x76EE;&#x5F55;&#x4E0B;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;&#x4F60;&#x53EF;&#x4EE5;&#x65B0;&#x5EFA;&#x4E00;&#x4E2A;&#xFF09;&#x91CC;&#x9762;&#x5199;&#x660E;&#xFF0C;&#x6211;&#x7684;&#x8FD9;&#x4E2A;&#x6587;&#x4EF6;&#x5185;&#x5BB9;&#x5982;&#x4E0B;&#xFF1A;<br><figure class="highlight stylus"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br><span class="line">6</span><br><span class="line">7</span><br></pre></td><td class="code"><pre><span class="line"><span class="class">.DS_Store</span></span><br><span class="line">Thumbs<span class="class">.db</span></span><br><span class="line">db<span class="class">.json</span></span><br><span class="line">*<span class="class">.log</span></span><br><span class="line">node_modules/</span><br><span class="line">public/</span><br><span class="line">.deploy*/</span><br></pre></td></tr></table></figure><br>&#x8FD9;&#x91CC;&#x9762;&#x7684;node_modules&#x76EE;&#x5F55;&#x91CC;&#x9762;&#x653E;&#x7740;&#x4E00;&#x4E9B;node&#x7684;&#x6A21;&#x5757;&#xFF0C;public&#x76EE;&#x5F55;&#x5B58;&#x653E;&#x7740;hexo&#x4EA7;&#x751F;&#x7684;html&#x6587;&#x4EF6;&#xFF08;&#x4E5F;&#x5C31;&#x662F;&#x4F60;&#x7684;&#x535A;&#x5BA2;&#xFF09;&#x3002;&#x5F53;&#x4F60;&#x90E8;&#x7F72;&#x597D;&#x8FD9;&#x4E2A;&#x4ED3;&#x5E93;&#x540E;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x901A;&#x8FC7;&#x4EE5;&#x4E0B;git&#x547D;&#x4EE4;&#x6765;&#x628A;&#x4F60;&#x7684;&#x535A;&#x5BA2;&#x7CFB;&#x7EDF;&#x53D1;&#x5E03;GitHub&#x4ED3;&#x5E93;&#xFF1A;<br><figure class="highlight avrasm"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br></pre></td><td class="code"><pre><span class="line">git <span class="keyword">add</span> . <span class="preprocessor">#&#x628A;&#x6B64;&#x6B21;&#x66F4;&#x6539;&#x5199;&#x5165;git&#x7F13;&#x5B58;</span></span><br><span class="line">git commit -m <span class="string">&quot;some changes&quot;</span> <span class="preprocessor">#&#x628A;&#x6B64;&#x6B21;&#x66F4;&#x6539;&#x63D0;&#x4EA4;&#x5230;&#x672C;&#x5730;&#x5E93;&#x91CC;&#x53BB;</span></span><br><span class="line">git <span class="keyword">push</span> <span class="preprocessor">#&#x628A;&#x672C;&#x5730;&#x5E93;&#x66F4;&#x6539;&#x540C;&#x6B65;&#x5230;GitHub&#x8FDC;&#x7A0B;&#x5E93;&#x91CC;&#x53BB;</span></span><br><span class="line">git status <span class="preprocessor">#&#x67E5;&#x770B;&#x672C;&#x5730;git&#x5E93;&#x72B6;&#x6001;</span></span><br></pre></td></tr></table></figure><br>&#x5728;&#x8FD9;&#x4E2A;&#x5E93;&#x91CC;&#x4F60;&#x53EF;&#x4EE5;&#x627E;&#x5230;&#x4F60;&#x5199;&#x4F5C;&#x6E90;&#x6587;&#x4EF6;&#x7684;&#x6240;&#x6709;&#x53D1;&#x5E03;&#x7684;&#x7248;&#x672C;&#xFF0C;&#x5F53;&#x7136;&#x4E5F;&#x53EF;&#x4EE5;&#x56DE;&#x6EDA;&#x5230;&#x4EFB;&#x610F;&#x7248;&#x672C;&#x4E2D;&#x53BB;&#xFF0C;&#x76F8;&#x5F53;&#x7B80;&#x5355;&#x65B9;&#x4FBF;&#x3002;</p>
<h3 id="u56FE_u5E8A"><a href="#u56FE_u5E8A" class="headerlink" title="&#x56FE;&#x5E8A;"></a>&#x56FE;&#x5E8A;</h3><p>&#x5F53;&#x6211;&#x4EEC;&#x5199;&#x4F5C;&#x7684;&#x65F6;&#x5019;&#xFF0C;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x5F15;&#x7528;&#x56FE;&#x7247;&#x5230;&#x6587;&#x7AE0;&#x91CC;&#x53BB;&#xFF0C;&#x5982;&#x679C;&#x56FE;&#x7247;&#x5C11;&#x7684;&#x8BDD;&#x6211;&#x4EEC;&#x53EF;&#x4EE5;&#x76F4;&#x63A5;&#x628A;&#x56FE;&#x7247;&#x653E;&#x5165;&#x6BCF;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x76EE;&#x5F55;&#x91CC;&#x9762;&#xFF0C;&#x7136;&#x540E;&#x53D1;&#x5E03;&#x5230;GitHub&#x91CC;&#x53BB;&#xFF0C;&#x4F46;&#x662F;&#x8FD9;&#x6837;&#x4F1A;&#x5BFC;&#x81F4;GitHub&#x4ED3;&#x5E93;&#x53D8;&#x5F97;&#x8D8A;&#x6765;&#x8D8A;&#x5927;&#xFF0C;&#x5E76;&#x4E14;&#x540C;&#x6B65;&#x4F1A;&#x975E;&#x5E38;&#x6162;&#x3002;&#x6240;&#x4EE5;&#x6211;&#x4EEC;&#x9700;&#x8981;&#x4E00;&#x4E2A;&#x7A33;&#x5B9A;&#x5F3A;&#x5927;&#x957F;&#x4E45;&#x7684;&#x79C1;&#x4EBA;&#x56FE;&#x5E8A;&#x3002;&#x4E00;&#x822C;&#x5C0F;&#x578B;&#x7F51;&#x7AD9;&#x7684;&#x56FE;&#x5E8A;&#x90FD;&#x4E0D;&#x505A;&#x8003;&#x8651;&#x3002;</p>
<h4 id="u65B0_u6D6A_u5FAE_u535A_u56FE_u5E8A"><a href="#u65B0_u6D6A_u5FAE_u535A_u56FE_u5E8A" class="headerlink" title="&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x56FE;&#x5E8A;"></a>&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x56FE;&#x5E8A;</h4><p>&#x8FD9;&#x4E2A;&#x53EF;&#x4EE5;&#x5B89;&#x88C5;&#x4E00;&#x4E2A;Chrome&#x63D2;&#x4EF6;&#x6765;&#x5B9E;&#x73B0;&#xFF08;&#x5FAE;&#x535A;&#x56FE;&#x5E8A;&#xFF09;&#x3002;<br><img src="http://7xqna7.com1.z0.glb.clouddn.com/weibotuchuang.png" alt="&#x5FAE;&#x535A;&#x56FE;&#x5E8A;"><br>&#x5FAE;&#x535A;&#x56FE;&#x5E8A;&#x7684;&#x4F18;&#x70B9;&#x5C31;&#x662F;&#x81EA;&#x52A8;&#x7ED9;&#x4F60;&#x4EA7;&#x751F;&#x4E0D;&#x540C;&#x5C3A;&#x5BF8;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x8FD8;&#x8D34;&#x5FC3;&#x7684;&#x7ED9;&#x4F60;Markdown&#x7684;&#x8BED;&#x6CD5;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#x53EF;&#x80FD;&#x51FA;&#x5728;&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x5C4F;&#x853D;&#x8FD9;&#x79CD;&#x5916;&#x94FE;&#x4E86;&#xFF0C;&#x957F;&#x671F;&#x4F1A;&#x6709;&#x4E00;&#x4E9B;&#x9690;&#x60A3;&#x7684;&#x3002;</p>
<h4 id="u4E03_u725B_u4E91_u5B58_u50A8"><a href="#u4E03_u725B_u4E91_u5B58_u50A8" class="headerlink" title="&#x4E03;&#x725B;&#x4E91;&#x5B58;&#x50A8;"></a>&#x4E03;&#x725B;&#x4E91;&#x5B58;&#x50A8;</h4><p>&#x4ED8;&#x8D39;&#x7684;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x91CC;&#x9762;&#x4E03;&#x725B;&#x4E91;&#x5B58;&#x50A8;&#x7A33;&#x5B9A;&#x800C;&#x4E14;&#x4E0D;&#x9519;&#xFF0C;&#x514D;&#x8D39;&#x8BA4;&#x8BC1;&#x7684;&#x7528;&#x6237;&#x5C31;&#x6709;10GB&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#xFF0C;&#x6BCF;&#x6708;10G&#x4E0B;&#x8F7D;&#x6D41;&#x91CF;&#xFF0C;&#x8DB3;&#x591F;&#x535A;&#x5BA2;&#x7528;&#x4E86;&#x3002;&#x5F53;&#x4F60;&#x6CE8;&#x518C;&#x540E;&#x5EFA;&#x7ACB;&#x4E00;&#x4E2A;&#x65B0;&#x7A7A;&#x95F4;&#x540E;&#xFF0C;&#x4E0B;&#x8F7D;&#x4E00;&#x4E2A;qrsync&#x540C;&#x6B65;&#x5DE5;&#x5177;&#xFF0C;&#x53EF;&#x4EE5;&#x5F88;&#x65B9;&#x4FBF;&#x7684;&#x628A;&#x4F60;&#x672C;&#x5730;&#x7684;&#x6587;&#x4EF6;&#x63A8;&#x9001;&#x5230;&#x4E03;&#x725B;&#x4E91;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x91CC;&#x9762;&#xFF0C;&#x5177;&#x4F53;&#x5B89;&#x88C5;&#x6587;&#x6863;&#x4F60;&#x53EF;&#x4EE5;&#x770B;&#x5B98;&#x65B9;&#x7684;&#x8BF4;&#x660E;&#x6587;&#x6863;&#xFF0C;&#x6211;&#x8FD9;&#x91CC;&#x8D34;&#x51FA;&#x6765;&#x8FD9;&#x4E2A;&#x5DE5;&#x5177;&#x7684;&#x914D;&#x7F6E;&#x6587;&#x6863;(conf.json)&#x4F9B;&#x4F60;&#x53C2;&#x8003;&#xFF1A;<br><figure class="highlight json"><table><tr><td class="gutter"><pre><span class="line">1</span><br><span class="line">2</span><br><span class="line">3</span><br><span class="line">4</span><br><span class="line">5</span><br></pre></td><td class="code"><pre><span class="line">{</span><br><span class="line">    &quot;<span class="attribute">src</span>&quot;:<span class="value"><span class="string">&quot;your src dir&quot;</span></span>,</span><br><span class="line">    &quot;<span class="attribute">dest</span>&quot;:<span class="value"><span class="string">&quot;qiniu:access_key=123&amp;secret_key=456&amp;bucket=789&quot;</span></span>,</span><br><span class="line">    &quot;<span class="attribute">debug_level</span>&quot;:  <span class="value"><span class="number">1</span></span><br><span class="line"></span>}</span><br></pre></td></tr></table></figure><br>&#x5728;&#x8FD9;&#x91CC;&#x628A;src&#x66FF;&#x6362;&#x6210;&#x6CE5;&#x5B9E;&#x9645;&#x76EE;&#x5F55;&#x7684;&#x7EDD;&#x5BF9;&#x8DEF;&#x5F84;&#x3002;dest&#x91CC;&#x9762;&#x66FF;&#x6362;access_key&#x3001;secret_key&#x53CA;bucket&#x3002;<br>&#x8FD9;&#x6837;&#x6BCF;&#x5F53;&#x4F60;&#x5728;src&#x76EE;&#x5F55;&#x91CC;&#x6DFB;&#x52A0;&#x56FE;&#x7247;&#x540E;&#xFF0C;&#x6267;&#x884C;&#x5982;&#x4E0B;&#x547D;&#x4EE4;&#x5373;&#x53EF;&#x628A;src&#x76EE;&#x5F55;&#x7684;&#x6587;&#x4EF6;&#x63A8;&#x9001;&#x5230;bucket&#x91CC;&#x9762;&#x3002;<br><figure class="highlight css"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line"><span class="tag">qrsync</span> <span class="tag">conf</span><span class="class">.json</span></span><br></pre></td></tr></table></figure><br>&#x9700;&#x8981;&#x6CE8;&#x610F;&#x7684;&#x662F;src&#x76EE;&#x5F55;&#x91CC;&#x9762;&#x4E0D;&#x9700;&#x8981;&#x5EFA;&#x7ACB;&#x5B50;&#x76EE;&#x5F55;&#xFF0C;&#x56E0;&#x4E3A;&#x8FD9;&#x4E2A;&#x540C;&#x6B65;&#x5DE5;&#x5177;&#x4F1A;&#x5FFD;&#x7565;&#x5B50;&#x76EE;&#x5F55;&#xFF0C;&#x76F4;&#x63A5;&#x628A;&#x6587;&#x4EF6;&#x5168;&#x90E8;&#x653E;&#x5230;src&#x6839;&#x76EE;&#x5F55;&#x5373;&#x53EF;&#x3002;<br>&#x90A3;&#x600E;&#x4E48;&#x8BBF;&#x95EE;bucket&#x91CC;&#x9762;&#x7684;&#x56FE;&#x7247;&#x5462;&#xFF1F;&#x6BCF;&#x4E2A;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x90FD;&#x6709;&#x4E00;&#x4E2A;&#x57DF;&#x540D;&#xFF0C;&#x90A3;&#x4EFB;&#x4F55;&#x4E00;&#x5F20;&#x56FE;&#x7247;&#x8BBF;&#x95EE;&#x7684;&#x5F62;&#x5F0F;&#x5C31;&#x662F;&#xFF1A; <a href="http://&#x4E03;&#x725B;&#x5B58;&#x50A8;&#x57DF;&#x540D;/xxx.jpg" target="_blank" rel="external">http://&#x4E03;&#x725B;&#x5B58;&#x50A8;&#x57DF;&#x540D;/xxx.jpg</a> &#x3002;&#x90A3;&#x4E48;&#x6240;&#x6709;&#x56FE;&#x7247;&#x90FD;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x8C03;&#x7528;&#x5916;&#x94FE;&#x3002;&#x8003;&#x8651;&#x5230;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x6709;&#x6D41;&#x91CF;&#x7684;&#x9650;&#x5236;&#xFF0C;&#x4E3A;&#x4E86;&#x9632;&#x6B62;&#x522B;&#x4EBA;&#x8C03;&#x7528;&#x4F60;&#x7684;&#x56FE;&#x7247;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x5728;&#x5B58;&#x50A8;&#x7A7A;&#x95F4;&#x7BA1;&#x7406;&#x91CC;&#x9762;&#x8BBE;&#x7F6E;&#x767D;&#x540D;&#x5355;&#xFF0C;&#x628A;&#x4F60;&#x7684;&#x57DF;&#x540D;&#x6DFB;&#x52A0;&#x8FDB;&#x53BB;&#x5373;&#x53EF;&#xFF0C;&#x8FD9;&#x6837;&#x53EA;&#x6709;&#x4F60;&#x7684;&#x57DF;&#x540D;&#x53EF;&#x4EE5;&#x8BBF;&#x95EE;&#x8FD9;&#x4E2A;&#x56FE;&#x7247;&#x7B49;&#x5916;&#x94FE;&#x4E86;&#x3002;<br>&#x5982;&#x679C;&#x4F60;&#x89C9;&#x5F97;&#x4E03;&#x725B;&#x4E91;&#x5B58;&#x50A8;&#x65E0;&#x6CD5;&#x957F;&#x671F;&#x5B58;&#x6D3B;&#x7684;&#x8BDD;&#xFF0C;&#x4F60;&#x53EF;&#x4EE5;&#x628A;&#x672C;&#x5730;&#x8FD9;&#x4E2A;&#x56FE;&#x7247;&#x6587;&#x4EF6;&#x5939;&#x540C;&#x6B65;&#x5230;OneDrive&#x7F51;&#x76D8;&#x91CC;&#x53BB;&#xFF0C;&#x4F60;&#x751A;&#x81F3;&#x53EF;&#x4EE5;&#x628A;&#x6240;&#x6709;&#x7684;&#x6587;&#x4EF6;&#x90FD;&#x653E;&#x5230;OneDrive&#x91CC;&#x9762;&#x540C;&#x6B65;&#x4E0A;&#x53BB;&#xFF0C;&#x8FD9;&#x6837;&#x51E0;&#x4E2A;&#x5730;&#x65B9;&#x4E92;&#x4E3A;&#x5907;&#x4EFD;&#xFF0C;&#x5C31;&#x53EF;&#x4EE5;&#x957F;&#x4E45;&#x7684;&#x5199;&#x4E0B;&#x53BB;&#x4E86;&#x3002;</p>
<h4 id="u4F18_u96C5_u7684_u5199_u4F5C_u73AF_u5883"><a href="#u4F18_u96C5_u7684_u5199_u4F5C_u73AF_u5883" class="headerlink" title="&#x4F18;&#x96C5;&#x7684;&#x5199;&#x4F5C;&#x73AF;&#x5883;"></a>&#x4F18;&#x96C5;&#x7684;&#x5199;&#x4F5C;&#x73AF;&#x5883;</h4><p>&#x8FD9;&#x5C31;&#x662F;&#x6211;&#x89C9;&#x5F97;&#x4F18;&#x96C5;&#x7684;&#x5199;&#x4F5C;&#x73AF;&#x5883;&#x4E86;&#xFF0C;&#x4EFB;&#x4F55;&#x4E0D;&#x61C2;&#x7F16;&#x7A0B;&#x7684;&#x4EBA;&#x4E5F;&#x53EF;&#x4EE5;&#x8FD9;&#x4E48;&#x7ED9;&#x81EA;&#x5DF1;&#x641E;&#x4E00;&#x4E2A;&#x957F;&#x671F;&#x5199;&#x4F5C;&#x7684;&#x5730;&#x65B9;&#xFF0C;&#x4F60;&#x53EA;&#x9700;&#x8981;&#x82B1;&#x51E0;&#x5341;&#x5757;&#x94B1;&#x4E70;&#x4E00;&#x4E2A;&#x57DF;&#x540D;&#xFF0C;&#x5269;&#x4E0B;&#x7684;&#x90FD;&#x662F;&#x514D;&#x8D39;&#x7684;&#x3002;&#x9664;&#x4E86;&#x73AF;&#x5883;&#x642D;&#x5EFA;&#x524D;&#x671F;&#x7A0D;&#x5FAE;&#x6709;&#x70B9;&#x590D;&#x6742;&#x5916;&#xFF0C;&#x4E00;&#x65E6;&#x73AF;&#x5883;&#x642D;&#x5EFA;&#x597D;&#x540E;&#x5269;&#x4E0B;&#x7684;&#x5DE5;&#x4F5C;&#x5C31;&#x5F88;&#x7B80;&#x5355;&#x3002;<br><strong>&#x4F60;&#x62E5;&#x6709;&#x4E86;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x5F3A;&#x5927;&#x7684;&#x5199;&#x4F5C;&#x73AF;&#x5883;&#xFF0C;&#x6D41;&#x7A0B;&#x7B80;&#x5355;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x8F93;&#x5165;&#x4E24;&#x6761;&#x547D;&#x4EE4;&#xFF0B;&#x5199;&#x4E00;&#x4E2A;MD&#x6587;&#x6863;&#xFF0C;&#x4E0D;&#x9700;&#x8981;&#x9EBB;&#x70E6;&#x7684;&#x6392;&#x7248;&#xFF0C;&#x4E5F;&#x4E0D;&#x9700;&#x8981;&#x9EBB;&#x70E6;&#x7684;&#x53D1;&#x5E03;&#xFF0C;&#x56FE;&#x7247;&#x7B49;&#x5B58;&#x50A8;&#x4E5F;&#x662F;&#x975E;&#x5E38;&#x7B80;&#x5355;&#x7684;&#xFF0C;&#x53EA;&#x9700;&#x8981;&#x4E00;&#x6761;&#x540C;&#x6B65;&#x547D;&#x4EE4;&#x5373;&#x53EF;&#x5728;MD&#x6587;&#x6863;&#x91CC;&#x8BBF;&#x95EE;&#x56FE;&#x7247;&#x5730;&#x5740;&#x3002;&#x7136;&#x540E;&#x4F60;&#x5C31;&#x53EF;&#x4EE5;&#x5728;&#x4EFB;&#x4F55;&#x5730;&#x65B9;&#x8BBF;&#x95EE;&#x4F60;&#x7684;&#x535A;&#x5BA2;&#x4E86;&#xFF0C;&#x5404;&#x7C7B;&#x6587;&#x6863;&#x90FD;&#x6709;&#x51E0;&#x4E2A;&#x5730;&#x65B9;&#x4E92;&#x4E3A;&#x5907;&#x4EFD;&#xFF08;&#x5F02;&#x5730;&#x707E;&#x5907;&#xFF09;&#xFF0C;&#x957F;&#x671F;&#x4E0B;&#x53BB;&#x4F60;&#x5199;&#x7684;&#x4E1C;&#x897F;&#x90FD;&#x53EF;&#x4EE5;&#x5B89;&#x5168;&#x7684;&#x5B58;&#x50A8;&#x3001;&#x8BBF;&#x95EE;&#x548C;&#x641C;&#x7D22;&#xFF0C;&#x540C;&#x65F6;&#x6709;&#x5F3A;&#x5927;&#x7684;&#x7248;&#x672C;&#x7BA1;&#x7406;&#xFF0C;&#x4EFB;&#x4F55;&#x65F6;&#x5019;&#x4F60;&#x90FD;&#x53EF;&#x4EE5;&#x56DE;&#x6EDA;&#x5230;&#x4EFB;&#x610F;&#x7248;&#x672C;&#xFF0C;&#x4E0D;&#x8981;&#x62C5;&#x5FC3;&#x51FA;&#x9519;&#x3002;</strong><br><blockquote><p>&#x4F18;&#x96C5;&#x7684;&#x5199;&#x4F5C;&#x662F;&#x4E3A;&#x4E86;&#x66F4;&#x81EA;&#x7531;&#x7684;&#x8868;&#x8FBE;&#x81EA;&#x5DF1;&#x3002;</p>
</blockquote></p>
]]></content>
    <summary type="html">
    <![CDATA[<h3 id="u524D_u8A00"><a href="#u524D_u8A00" class="headerlink" title="&#x524D;&#x8A00;"></a>&#x524D;&#x8A00;</h3><p>&#x5199;&#x4F5C;&#x662F;]]>
    </summary>
    
      <category term="Github" scheme="http://madawei.net/tags/Github/"/>
    
      <category term="Hexo" scheme="http://madawei.net/tags/Hexo/"/>
    
      <category term="写作" scheme="http://madawei.net/tags/%E5%86%99%E4%BD%9C/"/>
    
      <category term="武器库" scheme="http://madawei.net/categories/%E6%AD%A6%E5%99%A8%E5%BA%93/"/>
    
  </entry>
  
  <entry>
    <title><![CDATA[打造优雅高效的Mac工作环境]]></title>
    <link href="http://madawei.net/2016/01/31/20160202/"/>
    <id>http://madawei.net/2016/01/31/20160202/</id>
    <published>2016-01-31T12:10:20.000Z</published>
    <updated>2016-02-02T05:45:45.000Z</updated>
    <content type="html"><![CDATA[<h3 id="u524D_u8A00"><a href="#u524D_u8A00" class="headerlink" title="&#x524D;&#x8A00;"></a>&#x524D;&#x8A00;</h3><p>&#x5BF9;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x8BA1;&#x7B97;&#x673A;&#x5DE5;&#x4F5C;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#xFF0C;&#x6253;&#x9020;&#x4E00;&#x4E2A;&#x9AD8;&#x6548;&#x4F18;&#x96C5;&#x7684;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#x5F88;&#x6709;&#x5FC5;&#x8981;&#xFF0C;&#x7531;&#x4E8E;&#x6211;&#x4E3B;&#x8981;&#x5DE5;&#x4F5C;&#x662F;&#x505A;Web&#x5F00;&#x53D1;&#x7684;&#xFF0C;&#x7ECF;&#x5E38;&#x9700;&#x8981;&#x5728;&#x952E;&#x76D8;&#x548C;&#x5C4F;&#x5E55;&#x524D;&#x5DE5;&#x4F5C;&#x5F88;&#x957F;&#x65F6;&#x95F4;&#xFF0C;&#x6240;&#x4EE5;&#x672C;&#x6587;&#x4E3B;&#x8981;&#x8BA8;&#x8BBA;&#x5728;Mac&#x7CFB;&#x7EDF;&#x4E0B;&#x7684;&#x5DE5;&#x4F5C;&#x73AF;&#x5883;&#x8BBE;&#x7F6E;&#xFF0C;&#x4F46;&#x662F;&#x6587;&#x4E2D;&#x6240;&#x6D89;&#x53CA;&#x7684;&#x5F88;&#x591A;&#x8F6F;&#x4EF6;Windows&#x7CFB;&#x7EDF;&#x548C;Linux&#x7CFB;&#x7EDF;&#x5927;&#x591A;&#x4E5F;&#x6709;&#x66FF;&#x4EE3;&#x54C1;&#xFF0C;&#x975E;Mac&#x7CFB;&#x7EDF;&#x5DE5;&#x4F5C;&#x7684;&#x540C;&#x5B66;&#x4E5F;&#x53EF;&#x4EE5;&#x6309;&#x7167;&#x8FD9;&#x4E2A;&#x601D;&#x8DEF;&#x6765;&#x501F;&#x9274;&#x3002;</p>
<h3 id="u7CFB_u7EDF_u7BC7"><a href="#u7CFB_u7EDF_u7BC7" class="headerlink" title="&#x7CFB;&#x7EDF;&#x7BC7;"></a>&#x7CFB;&#x7EDF;&#x7BC7;</h3><h4 id="u786C_u4EF6"><a href="#u786C_u4EF6" class="headerlink" title="&#x786C;&#x4EF6;"></a>&#x786C;&#x4EF6;</h4><ol>
<li>MacBook Pro(Retina Display/13&#x2019;)<br><img src="http://7xqna7.com1.z0.glb.clouddn.com/mac.png" alt="Mac"></li>
<li>Dell&#x663E;&#x793A;&#x5668;&#xFF08;UltraSharp U2412M&#xFF0F;24&#x2019;&#xFF0F;16:10&#xFF09;<br><img src="http://7xqna7.com1.z0.glb.clouddn.com/dell.png" alt="Mac"></li>
<li>HHKB&#x952E;&#x76D8;(P2 Type S)<br><img src="http://7xqna7.com1.z0.glb.clouddn.com/hhkb.jpg" alt="Mac"></li>
<li>&#x4E00;&#x526F;&#x4E0D;&#x9519;&#x7684;&#x8033;&#x673A;</li>
<li>Kindle<br><img src="http://7xqna7.com1.z0.glb.clouddn.com/kindle1.jpg" alt="Mac"></li>
<li>&#x7F51;&#x6613;&#x4E91;&#x97F3;&#x4E50;&#xFF0F;&#x8C46;&#x74E3;FM&#xFF0F;&#x540E;&#x6447;&#x6B4C;&#x5355;</li>
<li>&#x4E00;&#x628A;&#x597D;&#x6905;&#x5B50;</li>
</ol>
<hr>
<h4 id="u8F6F_u4EF6"><a href="#u8F6F_u4EF6" class="headerlink" title="&#x8F6F;&#x4EF6;"></a>&#x8F6F;&#x4EF6;</h4><p><img src="http://7xqna7.com1.z0.glb.clouddn.com/my-mac-app.png" alt="Mac"></p>
<ol>
<li><p>F.lux<br>&#x5C4F;&#x5E55;&#x8272;&#x6E29;&#x81EA;&#x52A8;&#x8C03;&#x8282;&#x795E;&#x5668;&#xFF0C;&#x62A4;&#x773C;&#x5FC5;&#x5907;&#x3002;</p>
</li>
<li><p>VPN(&#x53D1;&#x73B0;&#x66F4;&#x5927;&#x7684;&#x4E16;&#x754C;)<br><a href="https://www.ytpub.com/" title="[external]" target="_blank" rel="external">&#x4E91;&#x68AF;</a>&#x662F;&#x6211;&#x4E00;&#x76F4;&#x5728;&#x7528;&#x7684;&#x4ED8;&#x8D39;VPN&#xFF0C;&#x4E4B;&#x524D;&#x4E3A;&#x4E86;&#x514D;&#x8D39;&#x6298;&#x817E;&#x4E86;Google Agent&#x3001;&#x5404;&#x8DEF;&#x56FD;&#x5185;&#x5916;&#x514D;&#x8D39;VPN&#x3001;&#x79D1;&#x5B66;&#x7FFB;&#x5899;&#x53CA;&#x7528;&#x81EA;&#x5DF1;&#x7684;VPS&#x642D;&#x5EFA;OpenVPN&#x7B49;&#x65B9;&#x6CD5;&#xFF0C;&#x6700;&#x540E;&#x53D1;&#x73B0;&#x8FD8;&#x662F;&#x4ED8;&#x8D39;&#x6BD4;&#x8F83;&#x7701;&#x4E8B;&#xFF0C;&#x6BD5;&#x7ADF;&#x81EA;&#x5DF1;&#x7684;&#x65F6;&#x95F4;&#x662F;&#x6700;&#x8D35;&#x7684;&#x3002;</p>
</li>
<li><p>&#x82F1;&#x8BED;&#x8BCD;&#x5178;</p>
<blockquote><p>&#x82F1;&#x8BED;&#x4E0D;&#x597D;&#x53D1;&#x73B0;&#x66F4;&#x5927;&#x7684;&#x4E16;&#x754C;&#x4E5F;&#x6CA1;&#x7528;&#xFF0C;&#x5916;&#x9762;&#x7684;&#x4E16;&#x754C;&#x90FD;&#x662F;&#x82F1;&#x6587;&#x554A;&#xFF01;&#xFF01;&#xFF01;</p>
</blockquote>
<p>Mac&amp;iOS&#x4E0B;&#x6700;&#x597D;&#x7528;&#x7684;&#x8BCD;&#x5178;&#x83AB;&#x8FC7;&#x4E8E;<a href="http://www.eudic.net/eudic/mac_dictionary.aspx" title="[external]" target="_blank" rel="external">&#x6B27;&#x8DEF;&#x8BCD;&#x5178;</a>&#x4E86;&#x3002;Windows&#x548C;Linux&#x4E0B;&#x6709;&#x540C;&#x6837;&#x5F3A;&#x5927;&#x7684;MDict&#x5F00;&#x6E90;&#x8BCD;&#x5178;&#x8F6F;&#x4EF6;&#xFF0C;&#x4E0D;&#x8FC7;&#x5149;&#x6709;&#x8FD9;&#x4E24;&#x4E2A;&#x8BCD;&#x5178;&#x8F6F;&#x4EF6;&#x4E5F;&#x6CA1;&#x7528;&#xFF0C;&#x5FC5;&#x987B;&#x81EA;&#x5DF1;&#x6302;&#x8F7D;&#x4F60;&#x9700;&#x8981;&#x7684;&#x8BCD;&#x5178;&#x624D;&#x884C;&#xFF0C;&#x63A8;&#x8350;6&#x672C;&#x725B;&#x903C;&#x7684;ESL&#x8BCD;&#x5178;&#xFF1A;</p>
<blockquote>
<ul>
<li>Longman Dictionary of Contemporary English</li>
<li>Oxford Advanced Learner&#x2019;s Dictionary</li>
<li>Macmillan English Dictionary for Advanced Learners</li>
<li>Collins Cobuild Advanced Learner&#x2019;s English Dictionary</li>
<li>Cambridge Advanced Learner&#x2019;s Dictionary</li>
<li>Merriam-Webster&#x2019;s Advanced Learner&#x2019;s English Dictionary</li>
</ul>
</blockquote>
</li>
<li><p>Alfred 2<br>Mac&#x6548;&#x7387;&#x8F6F;&#x4EF6;&#x91CC;&#x7B2C;&#x4E00;&#x795E;&#x5668;&#xFF0C;&#x65E0;&#x8BBA;&#x7B80;&#x5355;&#x7528;&#x8FD8;&#x662F;&#x590D;&#x6742;&#x7528;&#x90FD;&#x80FD;&#x63D0;&#x9AD8;&#x4F60;&#x7684;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#xFF0C;&#x81F3;&#x4E8E;&#x7528;&#x6CD5;&#x8BF7;Google&#x6216;&#x8005;&#x77E5;&#x4E4E;&#xFF0C;&#x4F1A;&#x6709;&#x5F88;&#x591A;&#x6587;&#x7AE0;&#x4ECB;&#x7ECD;&#x600E;&#x4E48;&#x73A9;&#x7684;&#x3002;</p>
</li>
<li><p>Moom &amp; SizeUp<br>&#x7528;&#x5FEB;&#x6377;&#x952E;&#x5FEB;&#x901F;&#x5E03;&#x5C40;&#x540C;&#x4E00;&#x5C4F;&#x5E55;&#x4E0B;&#x4E0D;&#x540C;&#x7684;&#x7A97;&#x53E3;&#xFF0C;&#x6781;&#x5927;&#x7684;&#x63D0;&#x9AD8;&#x5DE5;&#x4F5C;&#x6548;&#x7387;&#xFF0C;&#x591A;&#x5C4F;&#x90FD;&#x53EF;&#x4EE5;&#x5FEB;&#x901F;&#x64CD;&#x4F5C;&#x5207;&#x6362;&#x3002;</p>
</li>
<li><p>iTerm &amp; zsh<br>iTerm&#x662F;Mac&#x4E0B;&#x4E00;&#x4E2A;&#x5F88;&#x597D;&#x7684;&#x7EC8;&#x7AEF;&#x8F6F;&#x4EF6;&#xFF1B;zsh&#x662F;shell&#x91CC;&#x7684;&#x795E;&#x5668;&#xFF0C;&#x8C01;&#x7528;&#x8C01;&#x77E5;&#x9053;&#x3002;</p>
</li>
<li><p>Bartender &amp; iStat Menus<br>&#x7528;&#x8FD9;&#x4E24;&#x4E2A;&#x5C0F;&#x5DE5;&#x5177;&#x7BA1;&#x7406;&#x4F60;&#x7684;&#x72B6;&#x6001;&#x680F;&#x4F1A;&#x662F;&#x4E0D;&#x9519;&#x7684;&#x9009;&#x62E9;&#x3002;</p>
</li>
<li><p>CheatSheet &amp; CleanMyMac 3 &amp; TotalFinder<br>CheatSheet&#x662F;Mac&#x4E0B;&#x4E00;&#x4E2A;&#x5168;&#x5C40;&#x7684;&#x5FEB;&#x6377;&#x952E;&#x63D0;&#x793A;&#x5C0F;&#x5DE5;&#x5177;&#xFF0C;&#x4ECE;&#x6B64;&#x5FEB;&#x6377;&#x952E;&#x4E0D;&#x9700;&#x8981;&#x8BB0;&#x4E86;&#xFF0C;&#x4EFB;&#x4F55;&#x8F6F;&#x4EF6;&#x91CC;&#x957F;&#x6309;Command&#x952E;&#x5373;&#x53EF;&#x8C03;&#x51FA;&#x5FEB;&#x6377;&#x952E;&#x5217;&#x8868;&#xFF1B;<br>CleanMyMac 3&#x5C31;&#x662F;Mac&#x4E2D;&#x7684;&#x6E05;&#x7406;&#x5783;&#x573E;&#x8F6F;&#x4EF6;&#xFF1B;<br>TotalFinder&#x628A;Finder&#x591A;&#x4E2A;&#x7A97;&#x53E3;&#x53D8;&#x6210;&#x6807;&#x7B7E;&#x5F0F;&#x7684;&#xFF1B;</p>
</li>
<li><p>Aria2GUI &amp; Thunder &amp; 115&#x7F51;&#x76D8;<br>&#x4E0D;&#x5F97;&#x4E0D;&#x8BF4;Aria2GUI&#x662F;&#x4E0B;&#x8F7D;&#x91CC;&#x7684;&#x4E00;&#x5927;&#x795E;&#x5668;&#xFF0C;&#x9650;&#x4E8E;&#x7BC7;&#x5E45;&#x8FD9;&#x91CC;&#x4E0D;&#x505A;&#x4ECB;&#x7ECD;&#xFF0C;&#x611F;&#x5174;&#x8DA3;&#x7684;&#x670B;&#x53CB;&#x53EF;&#x4EE5;&#x8BD5;&#x8BD5;&#x53BB;&#x7814;&#x7A76;&#xFF1B;<br>Thunder&#x7684;VIP&#x4F1A;&#x5458;&#x4E0B;&#x8F7D;&#x7684;&#x786E;&#x5FEB;&#xFF0C;&#x914D;&#x5408;115&#x7F51;&#x76D8;&#x79C1;&#x5BC6;&#x7A7A;&#x95F4;&#x641E;&#x4E00;&#x4E9B;&#x7247;&#x770B;&#x770B;&#x8FD8;&#x662F;&#x4E0D;&#x9519;&#x7684;&#xFF0C;&#x81F3;&#x4E8E;&#x79CD;&#x5B50;&#x600E;&#x4E48;&#x627E;&#xFF0C;&#x5404;&#x79CD;&#x78C1;&#x529B;&#x94FE;&#x63A5;&#x641C;&#x7D22;&#x7F51;&#x7AD9;&#x4F1A;&#x5E2E;&#x4F60;&#x627E;&#x7684;&#xFF0C;&#x591A;&#x641C;&#x7D22;&#x603B;&#x4F1A;&#x6709;&#x60CA;&#x559C;&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x7FFB;&#x5899;&#x540E;&#x3002;</p>
</li>
<li><p>Parallels Desktop<br>&#x7528;Mac&#x4F60;&#x79BB;&#x4E0D;&#x5F00;Windows&#x7684;&#xFF0C;&#x603B;&#x4F1A;&#x6709;&#x5404;&#x79CD;&#x5404;&#x6837;&#x5947;&#x8469;&#x7684;&#x539F;&#x56E0;&#x88AB;&#x8FEB;&#x8BA9;&#x4F60;&#x56DE;&#x5230;Windows&#x7684;&#xFF0C;Parallels Desktop&#x5B8C;&#x7F8E;&#x7684;&#x89E3;&#x51B3;&#x8FD9;&#x4E2A;&#x95EE;&#x9898;&#xFF0C;&#x662F;&#x771F;&#x6B63;&#x5B8C;&#x7F8E;&#x7684;&#x89E3;&#x51B3;&#xFF01;&#x878D;&#x5408;&#x6A21;&#x5F0F;&#x4E0B;&#x7684;Windows&#x8F6F;&#x4EF6;&#x5DF2;&#x7ECF;&#x65E0;&#x7F1D;&#x7684;&#x548C;Mac&#x73AF;&#x5883;&#x878D;&#x4E3A;&#x4E00;&#x4F53;&#x4E86;&#xFF0C;&#x65E0;&#x8BBA;&#x662F;&#x7092;&#x80A1;&#x8FD8;&#x662F;&#x7528;&#x7F51;&#x94F6;&#x90FD;&#x6CA1;&#x6709;&#x95EE;&#x9898;&#x3002;</p>
</li>
</ol>
<h3 id="u5F00_u53D1_u7BC7"><a href="#u5F00_u53D1_u7BC7" class="headerlink" title="&#x5F00;&#x53D1;&#x7BC7;"></a>&#x5F00;&#x53D1;&#x7BC7;</h3><p><img src="http://7xqna7.com1.z0.glb.clouddn.com/develop-tools.jpg" alt="Mac"></p>
<h4 id="u6587_u672C_u7F16_u8F91_u5668"><a href="#u6587_u672C_u7F16_u8F91_u5668" class="headerlink" title="&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;"></a>&#x6587;&#x672C;&#x7F16;&#x8F91;&#x5668;</h4><ol>
<li><p>Emacs &amp; Vim<br>&#x4E00;&#x4E2A;&#x662F;&#x795E;&#x7684;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x4E00;&#x4E2A;&#x662F;&#x7F16;&#x8F91;&#x5668;&#x4E4B;&#x795E;&#xFF0C;&#x6211;&#x65E0;&#x6CD5;&#x8BC4;&#x4EF7;&#xFF0C;Emacs&#x81F3;&#x4ECA;&#x4E0D;&#x4F1A;&#x7528;&#xFF0C;Vim&#x5012;&#x662F;&#x7ECF;&#x5E38;&#x7528;&#xFF08;&#x975E;&#x5E38;&#x68D2;&#xFF01;&#xFF09;&#x3002;</p>
</li>
<li><p>Sublime Text 3 &amp; Brackets<br>Web&#x5F00;&#x53D1;&#x4E24;&#x5927;&#x5229;&#x5668;&#xFF0C;Sublime Text 3&#x7ECF;&#x5E38;&#x7528;&#x5230;&#xFF0C;&#x4ED6;&#x7684;&#x597D;&#x4E0D;&#x7528;&#x6211;&#x591A;&#x8BF4;&#xFF0C;&#x5012;&#x662F;Brackets&#x5728;&#x5F00;&#x53D1;&#x524D;&#x7AEF;&#x7A0B;&#x5E8F;&#x7684;&#x65F6;&#x5019;&#x6211;&#x53D1;&#x73B0;&#x6548;&#x7387;&#x4E5F;&#x5F88;&#x9AD8;&#xFF0C;&#x67D0;&#x4E9B;&#x5730;&#x65B9;&#x5982;&#x4EE3;&#x7801;&#x81EA;&#x52A8;&#x63D0;&#x793A;&#x53CA;&#x5B9E;&#x65F6;&#x9884;&#x89C8;&#x8FD9;&#x5757;&#x505A;&#x7684;&#x8981;&#x6BD4;ST3&#x66F4;&#x68D2;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x4F53;&#x9A8C;&#x4E0B;&#x3002;</p>
</li>
<li><p>Mou &amp; Ulysses<br>Markdown&#x4E24;&#x4E2A;&#x5F88;&#x4E0D;&#x9519;&#x7684;&#x7F16;&#x8F91;&#x5668;&#xFF0C;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x5C31;&#x662F;&#x7528;Mou&#x5199;&#x51FA;&#x6765;&#x7684;&#xFF0C;Ulysses&#x6574;&#x4F53;&#x7ED9;&#x4EBA;&#x7684;&#x611F;&#x89C9;&#x662F;&#x66F4;&#x5B8C;&#x6574;&#xFF0C;&#x4F46;&#x662F;&#x4E5F;&#x5C01;&#x95ED;&#x3002;</p>
</li>
</ol>
<h4 id="IDE"><a href="#IDE" class="headerlink" title="IDE"></a>IDE</h4><ol>
<li><p>IntelliJ IDEA 14 CE<br>&#x975E;&#x5E38;&#x597D;&#x7684;Java&#x5F00;&#x53D1;IDE&#xFF01;</p>
</li>
<li><p>XCode<br>&#x6CA1;&#x5F97;&#x9009;&#x7684;&#x4E5F;&#x975E;&#x5E38;&#x597D;&#x7684;Mac&amp;iOS&#x5F00;&#x53D1;IDE&#xFF01;</p>
</li>
<li><p>Android Studio<br>&#x975E;&#x5E38;&#x597D;&#x7684;Android&#x5F00;&#x53D1;IDE&#xFF0C;&#x914D;&#x5408;Genymotion&#x865A;&#x62DF;&#x673A;&#x6548;&#x679C;&#x66F4;&#x597D;&#xFF01;</p>
</li>
<li><p>phpStorm<br>&#x6211;&#x4E2A;&#x4EBA;&#x89C9;&#x5F97;&#x5F88;&#x4E0D;&#x9519;&#x7684;PHP&#x5F00;&#x53D1;IDE&#xFF0C;&#x5C24;&#x5176;&#x662F;&#x5F00;&#x53D1;&#x4E00;&#x4E9B;&#x5927;&#x578B;&#x6846;&#x67B6;&#x7684;&#x65F6;&#x5019;&#x8FD9;&#x79CD;IDE&#x6548;&#x7387;&#x9AD8;&#x3002;</p>
</li>
<li><p>WingIDE<br>&#x6CA1;&#x600E;&#x4E48;&#x7528;&#x8FC7;&#x7684;&#x4E00;&#x4E2A;&#x542C;&#x8BF4;&#x4E0D;&#x9519;&#x7684;Python&#x5F00;&#x53D1;IDE&#xFF0C;&#x754C;&#x9762;&#x6BD4;&#x8F83;&#x4E11;&#x3002;</p>
</li>
</ol>
<h4 id="u8BBE_u8BA1_u7C7B"><a href="#u8BBE_u8BA1_u7C7B" class="headerlink" title="&#x8BBE;&#x8BA1;&#x7C7B;"></a>&#x8BBE;&#x8BA1;&#x7C7B;</h4><ol>
<li><p>Photoshop &amp; Sketch 3 &amp; Axure RP Pro 7<br>Photoshop&#x975E;&#x5E38;&#x9002;&#x5408;&#x5904;&#x7406;&#x70B9;&#x9635;&#x56FE;&#x50CF;&#xFF0C;&#x5F53;&#x7136;&#x4ED6;&#x53EF;&#x4EE5;&#x505A;&#x51FA;&#x5F88;&#x9006;&#x5929;&#x8BBE;&#x8BA1;&#xFF0C;&#x81F3;&#x4E8E;&#x6709;&#x591A;&#x4E48;&#x9006;&#x5929;&#xFF0C;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x53BB;<a href="https://www.behance.net/" title="[external]" target="_blank" rel="external">Behance</a>&#x56F4;&#x89C2;&#x3002;<br>Sketch&#xFF08;&#x53EA;&#x6709;Mac&#x7248;&#xFF09;&#x975E;&#x5E38;&#x9002;&#x5408;&#x505A;App&#x548C;Web Response Design&#x3002;<br>Axure RP Pro 7&#x5728;Windows&#x4E0B;&#x4F1A;&#x662F;&#x4E0D;&#x9519;&#x7684;&#x8BBE;&#x8BA1;&#x8F6F;&#x4EF6;&#x9009;&#x62E9;&#x3002;</p>
</li>
<li><p>iThoughtsX &amp; MindNote<br>&#x4E24;&#x4E2A;&#x90FD;&#x662F;&#x4E0D;&#x9519;&#x7684;&#x601D;&#x7EF4;&#x5BFC;&#x56FE;&#x8F6F;&#x4EF6;&#x3002;</p>
</li>
</ol>
<h3 id="u6548_u7387_u7BC7"><a href="#u6548_u7387_u7BC7" class="headerlink" title="&#x6548;&#x7387;&#x7BC7;"></a>&#x6548;&#x7387;&#x7BC7;</h3><ol>
<li><p>OmniGroup&#xFF08;&#x6548;&#x7387;&#x8F6F;&#x4EF6;&#x795E;&#x5668;&#x5F00;&#x53D1;&#x5546;&#xFF0C;&#x5C31;&#x4E00;&#x4E2A;&#x5B57;&#xFF1A;&#x8D35;&#xFF01;&#xFF09;<br>OmniFocus&#xFF1A;GTD&#x795E;&#x5668;&#xFF0C;&#x5165;&#x95E8;&#x96BE;&#xFF0C;&#x4F46;&#x662F;&#x4E00;&#x65E6;&#x638C;&#x63E1;&#x6536;&#x83B7;&#x4E5F;&#x5927;&#xFF0C;&#x81F3;&#x4E8E;&#x6709;&#x591A;&#x795E;&#xFF0C;&#x53EF;&#x4EE5;&#x53BB;&#x8C46;&#x74E3;&#x548C;&#x77E5;&#x4E4E;&#x641C;&#x7D22;&#x76F8;&#x5173;&#x8BDD;&#x9898;&#x3002;<br>OmniPlan&#xFF1A;Mac&#x4E0B;&#x505A;&#x9879;&#x76EE;&#x8BA1;&#x5212;&#x7BA1;&#x7406;&#x7684;&#x795E;&#x5668;&#xFF0C;&#x591A;&#x4EBA;&#x534F;&#x4F5C;&#x66F4;&#x662F;&#x7B80;&#x5355;&#x9AD8;&#x6548;&#xFF0C;&#x5F53;&#x7136;&#x548C;Tower.im&#x4E4B;&#x7C7B;&#x7684;&#x4E91;&#x670D;&#x52A1;&#x4E0D;&#x540C;&#xFF0C;&#x795E;&#x5668;&#x66F4;&#x4E13;&#x6CE8;&#x9879;&#x76EE;&#x7BA1;&#x7406;&#x3002;<br>OmniGraffle&#xFF1A;&#x505A;&#x6D41;&#x7A0B;&#x56FE;&#x7684;&#x795E;&#x5668;&#xFF0C;&#x582A;&#x6BD4;Windows&#x4E0B;&#x5F3A;&#x5927;&#x7684;Visio&#x3002;<br>OmniOutliner&#xFF1A;&#x505A;&#x5927;&#x7EB2;&#x7684;&#x795E;&#x5668;&#xFF0C;&#x53EF;&#x4EE5;&#x5E2E;&#x4F60;&#x6574;&#x7406;&#x601D;&#x8DEF;&#x3002;</p>
</li>
<li><p>OneNote &amp; Office 2016 &amp; OneDrive<br>OneNote&#xFF1A;&#x53F2;&#x4E0A;&#x6700;&#x5F3A;&#x7B14;&#x8BB0;&#x672C;&#xFF0C;&#x6784;&#x5EFA;&#x4E2A;&#x4EBA;&#x77E5;&#x8BC6;&#x4F53;&#x7CFB;&#x7684;&#x795E;&#x5668;&#xFF0C;&#x4E00;&#x65E6;&#x638C;&#x63E1;&#x6536;&#x83B7;&#x5DE8;&#x5927;&#xFF0C;&#x5EFA;&#x8BAE;&#x5927;&#x5BB6;&#x53BB;&#x77E5;&#x4E4E;&#x770B;&#x770B;&#x76F8;&#x5173;&#x7684;&#x8BA8;&#x8BBA;&#x3002;<br>Office 2016&#xFF1A;&#x529E;&#x516C;&#x795E;&#x5668;&#x3002;&#x5F88;&#x591A;&#x4EBA;&#x4E00;&#x76F4;&#x5728;&#x7528;Office&#xFF0C;&#x5374;&#x8FDE;&#x5B83;&#x6700;&#x57FA;&#x672C;&#x7684;&#x529F;&#x80FD;&#x90FD;&#x7528;&#x4E0D;&#x597D;&#xFF0C;Office&#x91CC;&#x9762;&#x4EFB;&#x4F55;&#x4E00;&#x4E2A;&#x8F6F;&#x4EF6;&#x90FD;&#x591F;&#x4F60;&#x5B66;&#x4E00;&#x6574;&#x5E74;&#x7684;&#x4E86;&#x3002;&#x5F53;&#x7136;&#x5B66;&#x597D;&#x540E;&#x88C5;&#x903C;&#x529F;&#x6548;&#x4E5F;&#x662F;&#x6709;&#x52A0;&#x6210;&#x7684;&#x3002;<br>OneDrive&#xFF1A;&#x5F53;&#x4F60;&#x4E0D;&#x80FD;&#x7528;Dropbox&#xFF0C;&#x56FD;&#x5185;&#x5404;&#x79CD;&#x4E91;&#x53C8;&#x4E0D;&#x653E;&#x5FC3;&#x7684;&#x8BDD;&#xFF0C;&#x8001;&#x724C;&#x5FAE;&#x8F6F;&#x7684;&#x4E91;&#x670D;&#x52A1;&#x8FD8;&#x662F;&#x5F88;&#x9760;&#x8C31;&#x7684;&#x3002;</p>
</li>
</ol>
<h3 id="u5DE5_u5177_u7BC7"><a href="#u5DE5_u5177_u7BC7" class="headerlink" title="&#x5DE5;&#x5177;&#x7BC7;"></a>&#x5DE5;&#x5177;&#x7BC7;</h3><ol>
<li><p>Keynote<br>&#x4EA7;&#x54C1;&#x7ECF;&#x7406;&#x88C5;&#x903C;&#x795E;&#x5668;&#xFF01;&#x5404;&#x7C7B;&#x624B;&#x673A;&#x5382;&#x5546;&#x4EA7;&#x54C1;&#x53D1;&#x5E03;&#x4F1A;&#x5FC5;&#x5907;&#x554A;&#xFF01;</p>
</li>
<li><p>iMovie<br>&#x5F88;&#x597D;&#x7528;&#x7684;&#x89C6;&#x9891;&#x526A;&#x8F91;&#x53CA;&#x7279;&#x6548;&#x5236;&#x4F5C;&#x8F6F;&#x4EF6;&#xFF0C;&#x7B80;&#x5355;&#x597D;&#x7528;&#xFF0C;iPhone&amp;iPad&#x90FD;&#x53EF;&#x4EE5;&#x526A;&#x51FA;&#x4E0D;&#x9519;&#x7684;&#x7247;&#x6765;&#x3002;&#x5F53;&#x7136;&#x4F60;&#x8981;&#x548C;Adobe&#x7684;AE&#x548C;Pr&#x8FD9;&#x7C7B;&#x795E;&#x5668;&#x6BD4;&#x7684;&#x8BDD;&#xFF0C;&#x5F53;&#x6211;&#x6CA1;&#x8BF4;&#x3002;</p>
</li>
<li><p>GarageBand<br>&#x7528;&#x5B83;&#x53EF;&#x4EE5;&#x7ED9;&#x4F60;App&#x641E;&#x4E00;&#x4E2A;MIDI&#x7535;&#x5B50;&#x4E50;&#x66F2;&#xFF0C;&#x5F53;&#x7136;&#x529F;&#x80FD;&#x5F88;&#x5F3A;&#x5927;&#xFF0C;&#x4E0D;&#x8FC7;Mac&#x4E0B;&#x7535;&#x5B50;&#x4E50;&#x5236;&#x4F5C;&#x66F4;&#x795E;&#x7684;&#x8F6F;&#x4EF6;&#x65F6;Logic Pro X&#xFF0C;&#x4EF7;&#x683C;&#x4E5F;&#x611F;&#x4EBA;&#x3002;</p>
</li>
<li><p>Google Chrome<br>&#x6700;&#x5FEB;&#x6700;&#x7A33;&#x5B9A;&#x7684;&#x6D4F;&#x89C8;&#x5668;&#x6709;&#x6728;&#x6709;&#xFF0C;JS V8 &#x5F15;&#x64CE;&#x4E0D;&#x662F;&#x5439;&#x51FA;&#x6765;&#x7684;&#x3002;</p>
</li>
<li><p>zoom.us<br>&#x591A;&#x4EBA;&#x8FDC;&#x7A0B;&#x89C6;&#x9891;&#x4F1A;&#x8BAE;&#x9996;&#x9009;zoom&#x554A;&#xFF0C;&#x514D;&#x8D39;&#x7A33;&#x5B9A;&#x901F;&#x5EA6;&#x5FEB;&#x3002;</p>
</li>
<li><p>Reeder<br>&#x975E;&#x5E38;&#x597D;&#x7684;RSS&#x8BA2;&#x9605;&#x8F6F;&#x4EF6;&#xFF0C;&#x867D;&#x7136;RSS&#x5DF2;&#x6B7B;&#xFF0C;&#x4F46;&#x662F;&#x8BA2;&#x9605;&#x65B0;&#x95FB;&#x8FD8;&#x662F;&#x6709;&#x9700;&#x6C42;&#x7684;&#x3002;</p>
</li>
<li><p>Bilibili<br>&#x4E00;&#x79D2;&#x8FDB;&#x5165;&#x4E8C;&#x6B21;&#x5143;&#x4E16;&#x754C;&#xFF0C;&#x9B3C;&#x755C;&#x533A;&#x6B22;&#x8FCE;&#x4F60;&#xFF01;&#xFF01;&#xFF01;</p>
</li>
<li><p>Twitter<br>&#x65B0;&#x6D6A;&#x5FAE;&#x535A;&#x771F;&#x662F;&#x4E00;&#x4E2A;&#x7A7F;&#x8863;&#x670D;&#x5305;&#x88C5;&#x7684;&#x597D;&#x5730;&#x65B9;&#xFF0C;&#x5E7F;&#x544A;&#x4E91;&#x96C6;&#xFF0C;&#x8FD8;&#x662F;Twitter&#x7B80;&#x5355;&#x597D;&#x7528;&#xFF0C;&#x591A;&#x5173;&#x6CE8;&#x4E9B;&#x4EBA;&#x4E5F;&#x4F1A;&#x8BA9;Twitter&#x53D8;&#x6210;&#x4E00;&#x4E2A;&#x975E;&#x5E38;&#x4E0D;&#x9519;&#x7684;&#x4FE1;&#x606F;&#x6765;&#x6E90;&#x5730;&#x3002;</p>
</li>
</ol>
<h3 id="The_End"><a href="#The_End" class="headerlink" title="The End"></a>The End</h3><figure class="highlight lisp"><table><tr><td class="gutter"><pre><span class="line">1</span><br></pre></td><td class="code"><pre><span class="line">alert<span class="list">(<span class="quoted">&apos;Hello</span> World!&apos;)</span><span class="comment">;</span></span><br></pre></td></tr></table></figure>
]]></content>
    <summary type="html">
    <![CDATA[<h3 id="u524D_u8A00"><a href="#u524D_u8A00" class="headerlink" title="&#x524D;&#x8A00;"></a>&#x524D;&#x8A00;</h3><p>&#x5BF9;&#x7ECF;&#x5E38;]]>
    </summary>
    
      <category term="IT开发" scheme="http://madawei.net/tags/IT%E5%BC%80%E5%8F%91/"/>
    
      <category term="Mac" scheme="http://madawei.net/tags/Mac/"/>
    
      <category term="全栈开发" scheme="http://madawei.net/categories/%E5%85%A8%E6%A0%88%E5%BC%80%E5%8F%91/"/>
    
  </entry>
  
</feed>
